
_detalhes_global = {
	["npcid_pool"] = {
		[7156] = "死木守卫",
		[10375] = "尖塔小蜘蛛",
		[10407] = "鲜肉食尸鬼",
		[10439] = "吞咽者拉姆斯登",
		[10471] = "通灵学院侍僧",
		[10503] = "詹迪斯·巴罗夫",
		[7332] = "枯萎矛鬃野猪人",
		[7348] = "噬棘食尸鬼",
		[10663] = "魔法利爪",
		[7396] = "土灵破石者",
		[7428] = "霜槌巨人",
		[7444] = "pipi",
		[10823] = "祖布林·扭枝",
		[10951] = "肆虐的尸体",
		[7604] = "布莱中士",
		[7796] = "耐克鲁姆",
		[11559] = "玛格拉姆通灵师",
		[7844] = "火焰新星图腾 IV <安图苏尔>",
		[11687] = "鬼魅袭击者",
		[11783] = "瑟莱德丝碎片",
		[11911] = "恐怖图腾佣兵",
		[4101] = "尖啸的游荡者",
		[4117] = "风蛇",
		[521] = "狗弟是条狗",
		[2099] = "处女号的船员",
		[8520] = "瘟疫破坏者",
		[4277] = "基尔罗格之眼",
		[4293] = "血色占卜师",
		[4341] = "尘泥鳄鱼",
		[547] = "野猪",
		[4389] = "黑色蛇颈龙",
		[8904] = "暗炉议员",
		[2243] = "辛迪加哨兵",
		[2251] = "巨型雪人",
		[9032] = "爬行者赫杜姆",
		[2267] = "希尔斯布莱德农民",
		[9096] = "狂爪龙人",
		[575] = "火元素",
		[13319] = "指挥官杜菲",
		[13447] = "诺雷格·雷矛中尉",
		[587] = "血顶战士",
		[9416] = "裂盾座狼",
		[9448] = "血色禁卫队",
		[2371] = "刺脊海妖",
		[2379] = "管理员斯密瑟斯",
		[2387] = "希尔斯布莱德议员",
		[4789] = "腐根游荡者",
		[4805] = "黑暗深渊海巫",
		[4853] = "石窟地占师",
		[9736] = "军需官兹格雷斯",
		[2451] = "农夫卡拉巴",
		[10120] = "宝库护卫者",
		[10184] = "奥妮克希亚",
		[2555] = "枯木巫医",
		[14343] = "白云",
		[2571] = "石拳领主",
		[2579] = "山地秃鹰",
		[2587] = "辛迪加巡路者",
		[2595] = "刺脊袭击者",
		[10408] = "石翼石像鬼",
		[10440] = "瑞文戴尔男爵",
		[10472] = "通灵学院神秘学者",
		[10504] = "阿雷克斯·巴罗夫",
		[5269] = "阿塔莱祭司",
		[2643] = "邪枝狂战士",
		[2651] = "枯木剥皮者",
		[2659] = "翱翔的锋喙狮鹫",
		[10664] = "斯克利尔",
		[10696] = "避难谷地防御者",
		[671] = "血顶猎头者",
		[10760] = "恐怖图腾地卜师",
		[2707] = "沙德拉",
		[681] = "豹",
		[2731] = "山脊巡行者",
		[10952] = "肆虐的骷髅",
		[689] = "晶背蜥蜴",
		[697] = "血顶萨满祭司",
		[699] = "血顶兽王",
		[701] = "血顶秘法师",
		[709] = "莫什奥格好战者",
		[5685] = "被俘虏的食尸鬼",
		[5717] = "米杉",
		[11464] = "扭木纠缠者",
		[11496] = "伊莫塔尔",
		[5781] = "异种爬行者的卵 <异种爬行者>",
		[2907] = "火烟秘法师",
		[729] = "haotian",
		[2923] = "癞皮银鬃狼",
		[5861] = "暮光火焰卫士",
		[11784] = "瑟莱德丝卫士",
		[5925] = "根基图腾 <吉恩丶石蹄>",
		[11880] = "暮光复仇者",
		[11912] = "恐怖图腾蛮兵",
		[3035] = "平原狮",
		[6117] = "上层精灵鬼巫",
		[12264] = "沙斯拉尔",
		[769] = "死亡狼蛛",
		[3115] = "尘风鹰身人",
		[3123] = "血爪锐齿龙",
		[3131] = "闪电蜥蜴",
		[8553] = "亡灵巫师",
		[8585] = "冰霜亡魂 <寒冰之王亚门纳尔>",
		[3243] = "长鬃草原狮",
		[3251] = "异种幼蝎",
		[6517] = "未知目标",
		[3267] = "钢鬃寻水者",
		[6549] = "宝珠之魔 <塔贝萨>",
		[9033] = "安格弗将军",
		[13160] = "腐蚀群居虫",
		[9097] = "裂盾军团战士",
		[13320] = "指挥官卡尔·菲利普",
		[9257] = "裂盾术士",
		[3379] = "火刃卫士",
		[9449] = "血色宣教士",
		[9545] = "恐怖的奴隶主",
		[855] = "幼年荆棘谷迅猛龙",
		[3435] = "洛克·奥克班恩",
		[3459] = "钢鬃战士",
		[3467] = "巴隆·朗绍尔",
		[3475] = "豹",
		[7029] = "黑石军官",
		[3531] = "月怒裁缝",
		[7077] = "土灵筑厅师",
		[7125] = "加德纳尔恶犬",
		[7157] = "死木复仇者",
		[3619] = "幽灵豹",
		[10409] = "石翼尖啸者",
		[10441] = "瘟疫鼠",
		[10505] = "讲师玛丽希亚",
		[7333] = "枯萎战斗野猪",
		[7349] = "墓穴魔",
		[921] = "风险投资公司伐木工",
		[10697] = "绿汁软泥怪",
		[3715] = "怒尾海巫",
		[7445] = "老碎齿熊",
		[937] = "库尔森丛林战士",
		[10953] = "霍古斯的仆从",
		[3771] = "冷心唤魔者",
		[7605] = "拉文",
		[3819] = "野棘捕猎者",
		[3851] = "影牙白头狼人",
		[3859] = "影牙暴怒者",
		[3875] = "鬼怪仆从",
		[11465] = "扭木践踏者",
		[7797] = "卢兹鲁",
		[11561] = "亡灵劫掠者",
		[3923] = "蓟皮洞穴守卫",
		[15720] = "木喉先祖 <清泉小雪-范克瑞斯>",
		[3939] = "钢鬃狼",
		[11785] = "黄眼蜥蜴",
		[11881] = "暮光地王",
		[11913] = "恐怖图腾巫师",
		[4011] = "幼年巨翼双足飞龙",
		[4027] = "血怒雷巫",
		[4051] = "塞纳里奥植物学家",
		[1015] = "高地迅猛龙",
		[4067] = "夜行虎",
		[12201] = "瑟莱德丝公主",
		[12265] = "熔岩爪牙 <火焰之王>",
		[4118] = "毒性风蛇",
		[1034] = "龙喉袭击者",
		[4150] = "盐石凝视者",
		[1046] = "红色龙族",
		[1062] = "可怕的奈兹里奥克",
		[8522] = "瘟疫水元素",
		[4278] = "指挥官斯普林瓦尔",
		[4294] = "血色魔术师",
		[1082] = "盐齿鳄鱼",
		[4342] = "尘泥锐爪鳄鱼",
		[4358] = "黑鳍污水鱼人",
		[8906] = "狂怒傀儡",
		[1126] = "野猪",
		[9034] = "黑特雷尔",
		[9098] = "裂盾缚法师",
		[1142] = "莫什奥格蛮兵",
		[9162] = "幼双帆龙",
		[1150] = "淡水鳄",
		[9258] = "裂盾袭击者",
		[1166] = "碎石怪先知",
		[4678] = "噬法魔犬",
		[4694] = "恐怖撕裂者",
		[4726] = "暴怒的雷霆蜥蜴",
		[1186] = "老黑熊",
		[1190] = "野猪",
		[4854] = "格瑞姆洛克",
		[10218] = "超强治疗结界 <燃棘巫医>",
		[1282] = "巡山人维克",
		[10442] = "多彩雏龙",
		[10506] = "传令官基尔图诺斯",
		[5270] = "阿塔莱食尸者",
		[5286] = "长牙奔跑者",
		[10602] = "乌洛克法师",
		[10698] = "被召唤的僵尸",
		[5366] = "北泉唤风者",
		[10762] = "黑手暴徒",
		[5462] = "巨型海元素",
		[10954] = "放血者",
		[10986] = "雪盲鹰身人",
		[11082] = "斯坦索姆信使",
		[5686] = "被俘虏的僵尸",
		[11466] = "上层精灵召唤者",
		[5766] = "草原幼狮",
		[11562] = "枯钳龙虾人",
		[11658] = "熔核巨人",
		[5846] = "黑铁工头",
		[11722] = "亚什防御者",
		[11786] = "黄眼掠夺者",
		[11914] = "黑衣戈霍夫",
		[5974] = "巨槌食人魔",
		[5990] = "红石蜥蜴",
		[1502] = "丑陋的僵尸",
		[1506] = "血色信徒",
		[1522] = "暗眼骷髅法师",
		[1526] = "破碎的尸体",
		[1530] = "腐烂的古尸",
		[1534] = "哀嚎的鬼魂",
		[1538] = "血色苦行修士",
		[8299] = "清风徐来",
		[1554] = "吸血夜行蝙蝠",
		[8523] = "天灾士兵",
		[8555] = "地穴恶魔",
		[8907] = "怒锤傀儡",
		[6518] = "焦油潜伏者",
		[6550] = "法力怒灵",
		[9035] = "安格雷尔",
		[1654] = "格里高·阿加曼德",
		[9163] = "双帆龙",
		[1662] = "派瑞恩队长",
		[9259] = "火印步兵",
		[1674] = "腐皮豺狼人",
		[9451] = "血色大法师",
		[9547] = "醉酒的奴隶主",
		[1718] = "石腭袭击者",
		[7030] = "暗炉地质学家",
		[7046] = "焦鳞幼龙",
		[14122] = "巨型喷泉 <海多斯博恩>",
		[7078] = "裂隙沙漠蝎",
		[7110] = "碧火捕猎者",
		[1782] = "月怒魔魂狼人",
		[7158] = "死木萨满祭司",
		[1794] = "没有灵魂的食尸鬼",
		[7206] = "古代的石头看守者",
		[10411] = "纳克萨玛斯之眼",
		[10475] = "通灵学院学员",
		[10507] = "拉文尼亚",
		[7334] = "恐怖战斗野猪",
		[1838] = "血色质问者",
		[1842] = "大领主泰兰·弗丁",
		[14762] = "挫志怒吼",
		[10699] = "腐食甲虫 <地穴恐魔>",
		[7430] = "霜刃豹幼崽",
		[7446] = "疯狂的碎齿熊",
		[1866] = "鸦爪奴隶",
		[10955] = "被召唤的水元素 <红衣魔术师>",
		[10987] = "深铁穴居怪",
		[1894] = "月怒哨兵",
		[7606] = "欧罗·血眼",
		[1910] = "穆亚德",
		[1914] = "达拉然法师",
		[1934] = "提瑞斯法农夫",
		[1946] = "莉莉丝·奈法拉",
		[1954] = "老迈的湖岸潜藏者",
		[11563] = "枯钳巨螯龙虾人",
		[11659] = "熔核摧毁者",
		[11723] = "亚什沙行者",
		[7942] = "法拉罗恩",
		[11883] = "暮光主宰",
		[11915] = "高戈护石者",
		[2034] = "尼娅",
		[12203] = "兰斯利德",
		[4119] = "风蛇",
		[4151] = "盐石水晶蜥蜴",
		[8524] = "诅咒法师",
		[4279] = "盲眼守卫奥杜",
		[4295] = "血色仆从",
		[4343] = "尘泥钳嘴鳄鱼",
		[4359] = "黑鳍鱼人",
		[4391] = "沼泽软泥怪",
		[8876] = "沙怒侍僧",
		[8908] = "熔岩作战傀儡",
		[2244] = "辛迪加暗影法师",
		[2252] = "破碎岭食人魔",
		[9036] = "瓦勒雷尔",
		[2268] = "希尔斯布莱德步兵",
		[9164] = "老双帆龙",
		[9196] = "欧莫克大王",
		[13323] = "地下双帆龙",
		[9260] = "火印军团战士",
		[4663] = "火刃预言师",
		[4695] = "恐怖腐化鸟",
		[4711] = "滑刃纳迦",
		[4727] = "老迈的雷霆蜥蜴",
		[2372] = "泥嘴豺狼人",
		[4807] = "黑暗深渊仆从",
		[4823] = "刺毛甲壳蟹",
		[9708] = "燃烧小鬼 <裂盾术士>",
		[4887] = "加摩拉",
		[2460] = "巴纳姆·石衣",
		[14187] = "亚斯拉玛尼斯",
		[2540] = "达拉然毒蛇 <达拉然保卫者>",
		[14283] = "雷矛猫头鹰",
		[2556] = "枯木猎头者",
		[2564] = "石拳执行者",
		[2572] = "枯须狗头人",
		[2580] = "老山地秃鹰",
		[2588] = "辛迪加潜伏者",
		[10412] = "地穴爬行者",
		[10476] = "通灵学院通灵师",
		[10508] = "莱斯·霜语",
		[5271] = "阿塔莱死亡行者",
		[5287] = "长牙嚎叫者",
		[2652] = "枯木毒血巨魔",
		[14763] = "丹巴达尔南部统帅",
		[2676] = "微型收割机",
		[2692] = "高原斥候",
		[2716] = "火烟猎龙者",
		[2732] = "山脊雌豹",
		[2740] = "暗炉巫师",
		[2748] = "阿扎达斯",
		[5623] = "废土刺客",
		[5687] = "被俘虏的憎恶",
		[5719] = "摩弗拉斯",
		[2924] = "银鬃狼",
		[11788] = "岩石虫",
		[5975] = "巨槌食人魔法师",
		[5991] = "红石晶鳞蜥蜴",
		[12076] = "熔岩元素",
		[12236] = "维利塔恩",
		[8525] = "天灾看守",
		[8557] = "地穴恐魔",
		[6375] = "雷首角鹰兽",
		[3204] = "加祖兹",
		[12876] = "阿奎尼斯男爵",
		[12940] = "鞭笞者沃尔沙",
		[8877] = "未知目标",
		[8909] = "火焰卫士",
		[3260] = "刺背寻水者",
		[3268] = "钢鬃织棘者",
		[3276] = "巫翼鹰身人",
		[3284] = "风险投资公司苦工",
		[13196] = "相位鞭笞者",
		[9165] = "小翼手龙",
		[9197] = "尖石战斗法师",
		[9261] = "火印暗法师",
		[3380] = "火刃侍僧",
		[3396] = "赫兹鲁尔·血印",
		[9517] = "暗影领主费尔丹",
		[3436] = "卡兹",
		[3452] = "塞瑞娜·血羽",
		[3476] = "依沙瓦克",
		[7031] = "黑曜石元素",
		[7047] = "黑色小龙",
		[14188] = "德尔克",
		[7111] = "碧火唤魔者",
		[10221] = "血斧座狼幼崽",
		[7175] = "石窟伏击者",
		[10317] = "黑手精英",
		[10381] = "被毁坏的死尸",
		[10413] = "地穴兽",
		[7271] = "巫医祖穆拉恩",
		[10477] = "通灵学院亡灵法师",
		[10509] = "杰德",
		[7335] = "亡首地卜师",
		[7351] = "墓穴劫掠者",
		[14764] = "冰翼统帅",
		[7447] = "冰风奇美拉幼兽",
		[3748] = "污林萨满祭司",
		[10925] = "腐烂虫",
		[11053] = "高阶牧师玛多妮尔",
		[3820] = "野棘毒蜘蛛",
		[3844] = "治疗结界 IV <钢鬃先知>",
		[3868] = "觅血者",
		[11469] = "艾德雷斯怨魂",
		[11501] = "戈多克大王",
		[7847] = "卡利夫·斯科比斯汀",
		[11661] = "烈焰行者",
		[11789] = "深岩虫",
		[3988] = "风险投资公司操作员",
		[4004] = "风剪霸主",
		[11949] = "巴琳达·斯通赫尔斯",
		[4020] = "腐蚀兽",
		[4028] = "烧焦的树人",
		[4036] = "游荡的焰灵",
		[4044] = "黑色石化蜥蜴",
		[12141] = "冰图腾 <蛮爪萨满祭司>",
		[12237] = "收割者麦什洛克",
		[4104] = "尖啸的唤风者",
		[4120] = "雷鸣岩石元素",
		[4248] = "杂毛土狼",
		[4264] = "深苔雌蜘蛛 <深苔幼蛛>",
		[4280] = "血色医师",
		[4296] = "血色老兵",
		[4328] = "火鬃守卫",
		[4344] = "尘泥杂斑鳄鱼",
		[8910] = "炽热火焰卫士",
		[4472] = "亡鬼幻象",
		[4504] = "霜喉雪人",
		[9038] = "西斯雷尔",
		[13197] = "魔鞭抽笞者",
		[9166] = "翼手龙",
		[9198] = "尖石秘法师",
		[9262] = "火印祈求者",
		[4664] = "火刃劫掠者",
		[4680] = "末日看守队长",
		[4696] = "蝎子",
		[4712] = "滑刃巫师",
		[4728] = "砂腭蜥蜴",
		[9518] = "未知目标",
		[4856] = "石窟猎手",
		[4872] = "黑曜石傀儡",
		[5048] = "无毒飞蛇",
		[14349] = "匹姆吉布",
		[10318] = "黑手刺客",
		[10382] = "被撕裂的死尸",
		[10414] = "缝补憎恶",
		[5224] = "黑暗滑行虫",
		[5240] = "戈杜尼术士",
		[5256] = "阿塔莱战士",
		[5272] = "铁鬃灰熊",
		[5288] = "疯狂的长牙狼",
		[5304] = "乱羽翼鹿",
		[14765] = "石炉统帅",
		[14861] = "基尔图诺斯的卫士",
		[10990] = "奥特兰克山羊",
		[11054] = "红衣火枪手 <炮手威利>",
		[15213] = "暮光霸主",
		[5720] = "德拉维沃尔",
		[11470] = "艾德雷斯巫师",
		[11502] = "拉格纳罗斯",
		[11598] = "复活的守护者",
		[11662] = "烈焰行者祭司",
		[11790] = "腐烂萨特",
		[11886] = "米库提奥·污血",
		[5976] = "巨槌蛮兵",
		[5992] = "灰鬃野猪",
		[6008] = "魔誓术士",
		[12046] = "掠夺者格玛洛克",
		[12206] = "原始巨兽",
		[8527] = "未知目标",
		[8911] = "火焰驱逐者",
		[6520] = "灼热元素",
		[9039] = "杜姆雷尔",
		[9167] = "狂怒的翼手龙",
		[9199] = "尖石执行者",
		[13326] = "经验丰富的防御者",
		[9263] = "火印恐法师",
		[13422] = "勇猛的防御者",
		[9583] = "血斧精兵",
		[7032] = "巨型黑曜石元素",
		[7048] = "炽热小龙",
		[7112] = "加德纳尔祭司",
		[14350] = "未知目标 <海多斯博恩>",
		[10319] = "黑手铁卫士",
		[10383] = "破碎的死尸 <被毁坏的死尸>",
		[10415] = "阿莎利水晶",
		[10447] = "多彩龙人",
		[7320] = "石窟虐待者",
		[7352] = "冰冻之魂",
		[7368] = "石肤图腾 VI <吉恩丶石蹄>",
		[14766] = "冰血统帅",
		[7400] = "灼热图腾 V <吉恩丶石蹄>",
		[7432] = "霜刃捕食者",
		[7448] = "冰风奇美拉",
		[10991] = "蛮爪豺狼人",
		[11023] = "维尔顿·巴罗夫",
		[7608] = "穆尔塔",
		[11439] = "詹迪斯·巴罗夫的幻象 <詹迪斯·巴罗夫>",
		[11471] = "艾德雷斯鬼怪",
		[7848] = "潜伏的深痕雪人",
		[7864] = "徘徊的上层精灵",
		[11663] = "烈焰行者医师",
		[7944] = "工匠大师欧沃斯巴克",
		[11887] = "地穴抢劫者",
		[12143] = "烈焰之子",
		[12207] = "塞萨拉多头怪",
		[12239] = "吉尔克",
		[2053] = "哈迦德难民",
		[12431] = "血牙狼人",
		[8400] = "奥比斯顿",
		[4249] = "杂毛嚎叫者",
		[8528] = "恐怖编织者",
		[8560] = "烂苔斥候",
		[4297] = "血色咒术师",
		[8656] = "未知目标 <胡库>",
		[4345] = "尘泥利齿鳄鱼",
		[8720] = "拍卖师雷姆斯",
		[8912] = "暮光之锤拷问者",
		[2245] = "辛迪加破坏者",
		[2253] = "破碎岭蛮兵",
		[2261] = "辛迪加卫士",
		[2269] = "希尔斯布莱德矿工",
		[9200] = "尖石劫掠者",
		[9264] = "火印炎术师",
		[4665] = "火刃老兵",
		[4681] = "法师猎手",
		[2349] = "巨型食苔蛛",
		[4713] = "滑刃战士",
		[4729] = "笨重的砂腭蜥蜴",
		[2373] = "泥嘴萨满祭司",
		[9520] = "格拉克·洛克鲁布",
		[4809] = "暮光侍僧",
		[13743] = "腐化的自然之力",
		[4857] = "石头看守者",
		[9776] = "喷焰小鬼",
		[10000] = "阿鲁高",
		[5097] = "错觉狼影",
		[2557] = "枯木暗影猎手",
		[2565] = "巨型平原狼蛛",
		[2573] = "枯须勘探员",
		[2581] = "达比雷民兵",
		[2589] = "辛迪加雇佣兵",
		[10416] = "喷胆者",
		[5225] = "黑暗粘液虫",
		[10480] = "虚弱的尸体",
		[5273] = "阿塔莱高阶祭司",
		[2645] = "邪枝暗影猎手",
		[2653] = "枯木虐待者",
		[14767] = "哨塔高地统帅",
		[2693] = "高原神射手",
		[2701] = "火烟食人魔",
		[2717] = "火烟虐待者",
		[2725] = "滚烫的雏龙",
		[5481] = "灌木露水收集者",
		[10992] = "被激怒的黑豹",
		[11056] = "化学家阿尔比顿",
		[2773] = "奥卡拉尔",
		[11120] = "红衣铸锤师",
		[2829] = "饥饿的秃鹫",
		[11440] = "未知目标",
		[11472] = "艾德雷斯鬼巫",
		[2893] = "石窟断骨者",
		[11600] = "深铁萨满祭司",
		[11664] = "烈焰行者精英",
		[2925] = "银鬃嗥狼",
		[11792] = "腐烂巡影者",
		[5929] = "熔岩图腾 <枯木巫医>",
		[5993] = "地狱野猪",
		[12240] = "考尔克",
		[8337] = "黑铁塑钢师",
		[3125] = "巨钳蝎",
		[8497] = "噩梦镇压者",
		[8529] = "天灾勇士",
		[8561] = "烂苔暗影猎手",
		[8657] = "胡库的魅魔 <胡库>",
		[3197] = "火刃狂热者",
		[3245] = "暴躁的平原陆行鸟",
		[8913] = "暮光使者",
		[3261] = "刺背织棘者",
		[8977] = "克罗格鲁尔",
		[3277] = "巫翼游荡者",
		[9041] = "典狱官斯迪尔基斯",
		[13296] = "拉基特中尉",
		[9265] = "燃棘暗影猎手",
		[13456] = "诺克赛恩产物 <诺克赛恩>",
		[3381] = "未知目标",
		[3397] = "科卡尔战士",
		[3445] = "鲁格维兹主管",
		[3461] = "绿洲钳嘴龟",
		[9777] = "灵焰小鬼",
		[7033] = "火腹食人魔",
		[7049] = "火鳞小龙",
		[7097] = "雪诺丶 <溪夏丶>",
		[7113] = "加德纳尔守护者",
		[10161] = "群居雏龙",
		[10321] = "埃博斯塔夫",
		[10417] = "泼毒者",
		[3637] = "变异守护者",
		[10481] = "复生的尸体",
		[7321] = "石窟织炎者",
		[7337] = "亡首通灵师",
		[7353] = "寒冰之灵",
		[14768] = "霜狼东部统帅",
		[10737] = "希洛塔姆",
		[3717] = "怒尾巫师",
		[10801] = "喋喋不休的食尸鬼",
		[3749] = "污林巨熊怪",
		[3765] = "冷心萨特",
		[3797] = "塞纳里奥保卫者",
		[3821] = "野棘潜伏者",
		[3853] = "影牙夜行者",
		[3861] = "未知目标",
		[3877] = "哀嚎的卫兵",
		[11441] = "戈多克蛮兵",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[3917] = "污浊的水元素",
		[3925] = "蓟皮复仇者",
		[11665] = "熔岩歼灭者",
		[11793] = "塞雷布拉斯树妖",
		[3989] = "风险投资公司樵夫",
		[11921] = "贝瑟莱斯",
		[4021] = "腐蚀性的腐蚀兽",
		[4029] = "黑色古树",
		[4037] = "燃烧的掠夺者",
		[4053] = "塞纳留斯的女儿",
		[12241] = "玛格拉",
		[4093] = "加拉克争斗者",
		[12337] = "红衣信使",
		[1035] = "龙喉沼泽行者",
		[4154] = "盐湖食腐鹫",
		[1043] = "迷路的雏龙",
		[1047] = "红色刃鳞龙人",
		[1051] = "黑铁矮人",
		[1059] = "残忍的安纳希克",
		[8530] = "吃人的食尸鬼",
		[4282] = "血色魔法师",
		[4298] = "血色防御者",
		[8658] = "胡库的小鬼 <胡库>",
		[1087] = "盐齿钳嘴鳄",
		[4362] = "黑鳍滩行鱼人",
		[1095] = "风险投资公司经理",
		[8914] = "暮光保镖",
		[4474] = "腐烂的死尸",
		[1127] = "翻滚的肉包子",
		[1131] = "冬狼",
		[1151] = "海鳄",
		[9266] = "燃棘巫医",
		[1163] = "碎石怪击颅者",
		[1167] = "碎石怪掘地工",
		[1175] = "坑道鼠掘地工",
		[4714] = "滑刃侍从",
		[1191] = "比利海林顿",
		[1195] = "森林潜伏者",
		[4810] = "暮光劫掠者",
		[9778] = "火炬小鬼",
		[9938] = "玛格姆斯",
		[10162] = "维克多·奈法里奥斯",
		[14321] = "卫兵芬古斯",
		[10258] = "群居守卫者",
		[14385] = "末日守卫",
		[10418] = "红衣卫兵",
		[5226] = "黑暗虫",
		[10482] = "复活的侍从 <通灵学院黑暗召唤师>",
		[5274] = "铁鬃熊王",
		[5306] = "乱羽角鹰雄兽",
		[14769] = "霜狼西部统帅",
		[10738] = "冬泉酋长",
		[10802] = "守护者希坦亚",
		[1379] = "米兰",
		[11058] = "弗拉斯·希亚比",
		[89] = "地狱火爪牙 <没点毅丝>",
		[11442] = "戈多克虐待者",
		[11602] = "深铁碎颅者",
		[11666] = "火焰行者",
		[5850] = "炽热元素",
		[11730] = "雷戈伏击者",
		[92] = "石元素",
		[11794] = "塞雷布拉斯的姐妹",
		[11858] = "格鲁迪格·暗云",
		[5978] = "巨槌术士",
		[12018] = "管理者埃克索图斯",
		[1507] = "血色新兵",
		[1523] = "碎颅士兵",
		[1527] = "饥饿的死尸",
		[1531] = "失落的灵魂",
		[1535] = "血色战士",
		[1543] = "邪鳍污水鱼人",
		[1547] = "衰老的黑暗犬",
		[1555] = "邪恶的夜行蜘蛛",
		[8531] = "喋喋不休的食尸鬼",
		[8563] = "护林者",
		[6426] = "痛苦的死者",
		[6490] = "永醒的艾希尔",
		[8915] = "暮光之锤特使",
		[6554] = "格里什毒刺蝎",
		[13138] = "斯本瑟尔中尉",
		[1655] = "妮萨·阿加曼德",
		[13298] = "格雷瓦德中尉",
		[1667] = "迈文·考加尔",
		[9267] = "燃棘掷斧者",
		[1675] = "混血腐皮豺狼人",
		[9523] = "科卡尔风暴先知",
		[9683] = "拉克维的配偶",
		[6906] = "巴尔洛戈",
		[9779] = "怒焰小鬼",
		[7034] = "火腹食人魔法师",
		[1767] = "邪鳍切割者",
		[1779] = "月怒暴食者",
		[1783] = "骷髅剥皮者",
		[1787] = "骷髅刽子手",
		[1791] = "被奴役的食尸鬼",
		[14354] = "普希林",
		[14386] = "游荡的基尔罗格之眼",
		[7226] = "未知目标 <古代的石头看守者>",
		[10387] = "复仇的幻影",
		[10419] = "红衣魔术师",
		[7274] = "沙怒刽子手",
		[7290] = "暗炉狙击手",
		[1827] = "血色徘徊者",
		[1831] = "血色猎人",
		[1835] = "血色祈求者",
		[1843] = "工头杰瑞斯",
		[7402] = "灼热图腾 VI <吉恩丶石蹄>",
		[7434] = "霜刃守卫者",
		[1863] = "未知目标",
		[1867] = "达拉然学徒",
		[10899] = "古拉鲁克",
		[1883] = "血色工人",
		[11027] = "幻影怨灵 <召唤者阿拉基>",
		[119] = "Out",
		[1923] = "血牙座狼",
		[1935] = "提瑞斯法雇农",
		[11443] = "戈多克食人魔法师",
		[11475] = "艾德雷斯幻像",
		[11603] = "白须掘地工",
		[11667] = "烈焰守卫",
		[1983] = "奈塔拉什",
		[11859] = "末日守卫",
		[8138] = "苏利萨斯幼崽",
		[12243] = "温格",
		[4107] = "风巢双足飞龙",
		[12339] = "德米提雅",
		[2070] = "打我一下死个妈",
		[8532] = "生病的剥皮者",
		[8564] = "游侠",
		[8596] = "瘟疫幼犬",
		[4331] = "火鬃灰尾龙人",
		[4363] = "黑鳍智者",
		[4411] = "暗牙潜伏者",
		[8916] = "竞技场观众",
		[4475] = "坏死的僵尸",
		[2246] = "辛迪加刺客",
		[2254] = "破碎岭虐待者",
		[9044] = "裂盾哨兵",
		[2270] = "希尔斯布莱德哨兵",
		[13299] = "鲁纳丁中尉",
		[13331] = "精练的防御者",
		[4635] = "科卡尔逐风者",
		[4667] = "火刃暗影法师",
		[9396] = "震地者",
		[2358] = "达拉然召唤师",
		[9460] = "加基森卫兵",
		[2374] = "碎鳍泥浆鱼人",
		[9524] = "科卡尔入侵者",
		[4795] = "未知目标 <塞纳里奥辩护者>",
		[2406] = "零度妖姬 <零度修罗>",
		[4827] = "深池蛇颈龙",
		[9684] = "拉克维",
		[9716] = "血斧好战者",
		[13843] = "洛泰姆中尉",
		[154] = "食腐鸟",
		[4971] = "塔伯克的伙伴",
		[157] = "野猪",
		[5099] = "索雷尔·石衣",
		[14323] = "卫兵斯里基克",
		[2566] = "石拳蛮兵",
		[2574] = "枯须掘地工",
		[2582] = "达比雷劳工",
		[10356] = "贝恩",
		[10420] = "红衣新兵",
		[5243] = "被诅咒的阿塔莱巨魔",
		[10516] = "不可宽恕者",
		[5291] = "哈卡莱霜翼飞蛇",
		[5307] = "风蛇",
		[2686] = "枯木巢穴守卫",
		[2694] = "高原游侠",
		[10836] = "未知目标",
		[2718] = "火烟萨满祭司",
		[2726] = "烈焰守护者",
		[2734] = "山脊雄豹",
		[2742] = "暗炉吟唱者",
		[10996] = "英雄之魂",
		[5595] = "铁炉堡守卫",
		[2830] = "秃鹫",
		[11444] = "戈多克大法师",
		[11476] = "上层精灵骷髅",
		[5755] = "剧毒飞蛇",
		[2894] = "石窟萨满祭司",
		[11604] = "白须地占师",
		[11636] = "维尔顿·巴罗夫的仆从 <丶丨安然>",
		[11668] = "火焰之王",
		[2926] = "银鬃捕猎者",
		[11732] = "雷戈喷火者",
		[2958] = "草原狼",
		[5979] = "悲惨的失落者",
		[11988] = "焚化者古雷曼格",
		[3110] = "巨齿鳄鱼",
		[3126] = "硬甲蝎",
		[8437] = "哈卡莱爪牙",
		[12596] = "比比尔法兹",
		[8565] = "巡路者",
		[8597] = "瘟疫犬",
		[3198] = "火刃学徒",
		[6427] = "鬼魅幻影",
		[3238] = "雷鳞蜥蜴",
		[6507] = "狩猎暴掠龙",
		[13076] = "丹莫罗巡山人",
		[6555] = "格里什掘洞蝎",
		[9045] = "裂盾侍僧",
		[206] = "未知目标",
		[13300] = "曼库斯中尉",
		[9237] = "指挥官沃恩",
		[9269] = "燃棘先知",
		[3374] = "巴尔丹挖掘者",
		[3382] = "南海炮兵",
		[9461] = "狂乱的黑色幼龙",
		[213] = "饥饿的恐狼",
		[3414] = "塔文布莱德将军",
		[3438] = "克里尼格·糟鼻",
		[9717] = "血斧召唤师",
		[9877] = "萨瓦利斯王子",
		[7035] = "火腹蛮兵",
		[7099] = "爱生气的小气鬼",
		[7115] = "加德纳尔精兵",
		[14324] = "观察者克鲁什",
		[14356] = "锯鳍狂鱼",
		[10389] = "狂怒的幻影 <痞纯>",
		[10421] = "红衣防御者",
		[3638] = "吞噬软浆怪",
		[10485] = "复活的畸形骷髅",
		[3670] = "皮萨斯",
		[7355] = "图特卡什",
		[232] = "农夫雷恩",
		[7435] = "深蓝龙族",
		[7451] = "狂怒的枭兽",
		[10901] = "博学者普克尔特",
		[3758] = "魔草萨特",
		[10997] = "炮手威利",
		[3782] = "移石沼泽兽",
		[3854] = "影牙狼人卫兵",
		[3862] = "狼",
		[11445] = "戈多克领主",
		[11477] = "腐烂的上层精灵",
		[3902] = "灼热图腾 II",
		[11605] = "白须监工",
		[11669] = "烈焰小鬼",
		[11733] = "雷戈制奴者",
		[3974] = "驯犬者洛克希",
		[7995] = "未知目标",
		[4006] = "深苔结网蛛",
		[4022] = "血怒鹰身人",
		[8075] = "艾丹娜·邪爪",
		[4054] = "欢笑的姐妹",
		[4062] = "黑铁投弹手",
		[4070] = "风险投资公司建筑师",
		[4094] = "加拉克斥候",
		[4124] = "千针石林山狮",
		[4140] = "恐蝎劫掠者",
		[8438] = "哈卡莱护血者",
		[8534] = "腐烂的石像鬼",
		[8566] = "黑铁哨兵",
		[8598] = "狂怒的瘟疫犬",
		[4380] = "蜘蛛 <老年迪斯扣>",
		[4412] = "暗牙爬行者",
		[8886] = "变异巨蟒",
		[4460] = "黑腮首领",
		[13141] = "深腐践踏者",
		[4540] = "血色僧侣",
		[4636] = "科卡尔队长",
		[4668] = "火刃召唤师",
		[4684] = "地狱巫女",
		[9398] = "暮光之锤刽子手",
		[4716] = "滑刃潮行者",
		[9462] = "血喉酋长",
		[9526] = "暴怒的狮鹫",
		[9622] = "尤尔查",
		[4844] = "暗炉勘探员",
		[4860] = "石头管理者",
		[9878] = "热能野兽",
		[10038] = "守夜人",
		[14325] = "克罗卡斯",
		[14389] = "虚无行者 <游荡的基尔罗格之眼>",
		[10358] = "菲林森特的阴影",
		[10390] = "骷髅守护者",
		[10422] = "红衣法术师",
		[5228] = "深色软泥怪",
		[10486] = "复活的战士",
		[5260] = "格罗多克猿人",
		[5292] = "深痕雪人",
		[5308] = "游荡的山谷尖啸者",
		[10678] = "瘟疫龙崽",
		[5356] = "咆哮者",
		[10742] = "黑手驭龙者",
		[10806] = "尤西乌斯",
		[10838] = "指挥官阿什拉姆·瓦罗菲斯特",
		[345] = "野猪",
		[11318] = "怒焰穴居人",
		[5676] = "虚空行者",
		[5708] = "哈卡家的傻儿子",
		[5756] = "变异剧毒风蛇",
		[5852] = "地狱元素",
		[11734] = "雷戈主宰",
		[16117] = "野猪",
		[12118] = "鲁西弗隆",
		[8535] = "腐烂的尖啸者",
		[8567] = "暴食者",
		[6380] = "雷首角鹰雌兽",
		[6412] = "未知目标 <护锅者玛维诺斯>",
		[12918] = "穆戈特酋长",
		[6508] = "毒皮暴掠龙",
		[8983] = "傀儡统帅阿格曼奇",
		[6556] = "胶质软泥怪",
		[13142] = "深腐纠缠者",
		[412] = "缝合怪",
		[416] = "达格洛特",
		[6668] = "塞瑞克·黑炉公爵",
		[13718] = "无名预言者",
		[6908] = "奥拉夫",
		[9879] = "热能恐兽",
		[7036] = "索瑞森间谍",
		[441] = "黑龙雏龙",
		[442] = "狼蛛",
		[7100] = "曲木食苔者",
		[7132] = "剧毒之水",
		[14326] = "卫兵摩尔达",
		[10263] = "燃烧地狱卫士 <裂盾术士>",
		[7228] = "艾隆纳亚",
		[10391] = "骷髅狂战士",
		[10423] = "红衣牧师",
		[7276] = "祖尔法拉克阵亡英雄",
		[7292] = "丁尼塔·石衣",
		[7340] = "骷髅暗影法师 <骷髅召唤者>",
		[7356] = "腐烂的普雷莫尔",
		[7404] = "加拉克烈焰守卫",
		[10807] = "布鲁米兰",
		[11319] = "怒焰萨满祭司",
		[485] = "黑石前锋",
		[7788] = "沙怒苦工",
		[11671] = "熔火恶犬",
		[7996] = "守护者奇尔加",
		[12119] = "烈焰行者护卫",
		[8156] = "未知目标 <安图苏尔>",
		[4109] = "雄性风巢飞龙",
		[2103] = "龙喉斥候",
		[8440] = "哈卡的化身",
		[8504] = "黑铁斥候",
		[4285] = "血色追随者",
		[8600] = "瘟疫蝙蝠",
		[12759] = "泰德雷斯",
		[2175] = "影爪",
		[4413] = "暗牙蜘蛛",
		[8920] = "武器技师",
		[2247] = "辛迪加执行者",
		[9016] = "贝尔加",
		[2271] = "达拉然持盾守卫",
		[2287] = "破碎岭好战者",
		[9176] = "戈泰什",
		[9240] = "燃棘暗影牧师",
		[4637] = "科卡尔摧毁者",
		[9336] = "考博普拉格",
		[4685] = "灵能猎犬",
		[2351] = "灰熊",
		[2359] = "元素奴仆",
		[9464] = "主宰洛尔",
		[2375] = "碎鳍滩行鱼人",
		[9560] = "麦克斯韦尔元帅",
		[2407] = "豹",
		[4829] = "阿库麦尔",
		[4845] = "暗炉恶棍",
		[4861] = "利齿蝙蝠",
		[9816] = "烈焰卫士艾博希尔",
		[2503] = "希尔斯布莱德工头",
		[10040] = "格里什虫巢卫士",
		[5053] = "变异鳄鱼",
		[10200] = "豹",
		[14327] = "蕾瑟塔蒂丝",
		[10264] = "索拉卡·火冠",
		[14423] = "军官雅克森",
		[2591] = "辛迪加占星师",
		[10424] = "红衣豪侠",
		[10488] = "复活的构造体",
		[5261] = "被奴役的阿塔莱巨魔",
		[5277] = "噩梦刃鳞龙人",
		[10584] = "乌洛克",
		[2655] = "绿色淤泥怪",
		[10680] = "被召唤的黑手恐法师 <黑手召唤师>",
		[5357] = "大地行者",
		[674] = "风险投资公司露天矿工",
		[10808] = "悲惨的提米",
		[2719] = "火烟领主",
		[682] = "托尼",
		[2735] = "次级石元素",
		[5485] = "灌木塑根者",
		[688] = "石喉蜥蜴",
		[11032] = "狂热的玛洛尔",
		[694] = "血顶掷斧者",
		[2783] = "玛雷兹·考尔",
		[2791] = "被激怒的石元素",
		[702] = "血顶食腐者",
		[5645] = "沙怒剥皮者",
		[11320] = "钻土虫",
		[5709] = "伊兰尼库斯的阴影",
		[11448] = "戈多克术士",
		[11480] = "奥术畸兽",
		[11672] = "熔火怒犬",
		[5853] = "温和的作战傀儡",
		[736] = "黑豹",
		[2959] = "草原捕食者",
		[742] = "绿色龙族",
		[11896] = "淤血虫",
		[5981] = "传送门搜寻者",
		[12056] = "迦顿男爵",
		[12216] = "毒劣魔",
		[12248] = "渗透者哈米亚",
		[768] = "豹",
		[772] = "荆棘谷雌虎",
		[780] = "劈颅秘法师",
		[3127] = "毒尾蝎",
		[8601] = "毒性瘟疫蝙蝠",
		[12856] = "灰谷先驱者",
		[3239] = "电角蜥蜴",
		[8889] = "铁怒监军",
		[8921] = "血犬",
		[3263] = "刺背地卜师",
		[3271] = "钢鬃秘法师",
		[9017] = "伊森迪奥斯",
		[9177] = "奥拉留斯",
		[9241] = "燃棘猎头者",
		[840] = "守夜人巴库斯",
		[6733] = "石窟猛击者",
		[3375] = "巴尔丹工头",
		[3415] = "雌性草原狮",
		[856] = "幼年鞭尾迅猛龙",
		[13816] = "勘查员塔雷·石镐",
		[3471] = "工匠斯尼格斯",
		[9817] = "黑手恐法师",
		[3503] = "异种护卫者 <Soleil>",
		[7037] = "索瑞森驭火者",
		[10041] = "格里什皇后",
		[7101] = "曲木撕裂者",
		[10393] = "斯库尔",
		[10425] = "红衣战斗法师",
		[10489] = "复活的卫兵",
		[7309] = "土灵管理者",
		[7341] = "骷髅冰霜法师",
		[10617] = "加拉克信使",
		[10681] = "被召唤的黑手老兵 <黑手召唤师>",
		[7405] = "致命的裂隙沙漠蝎",
		[3711] = "怒尾侍从",
		[7437] = "深蓝龙人法师",
		[7453] = "月光枭兽",
		[7469] = "自然抗性图腾 III",
		[3743] = "污林战士",
		[938] = "库尔森特种兵",
		[3759] = "魔草潜行者",
		[3767] = "冷心欺诈者",
		[11257] = "通灵学院管理者",
		[11321] = "熔岩元素",
		[7725] = "恐怖图腾袭击者",
		[3887] = "席瓦莱恩男爵",
		[7789] = "沙怒智障者",
		[3903] = "灼热图腾 III <石拳萨满祭司>",
		[11609] = "奥蕾西娅·铁刃",
		[11673] = "上古熔火恶犬",
		[11737] = "石鞭掠夺者",
		[3975] = "赫洛德",
		[3983] = "审讯员韦沙斯",
		[3991] = "风险投资公司砍树工",
		[11897] = "暗翼蝠",
		[4007] = "深苔毒蜘蛛",
		[4023] = "血怒游荡者",
		[1008] = "混血藓皮豺狼人",
		[12057] = "加尔",
		[12217] = "腐化劣魔",
		[4095] = "加拉克虐待者",
		[4110] = "雌性风巢飞龙",
		[4126] = "峭壁捕猎者",
		[1036] = "龙喉百夫长",
		[4158] = "食腐鸟",
		[1044] = "喷火雏龙",
		[1052] = "黑铁破坏者",
		[8442] = "暗影蛛丝偷猎者",
		[8538] = "未知目标",
		[4286] = "血色士兵",
		[8602] = "巨型瘟疫蝙蝠",
		[4334] = "火鬃招炎者",
		[1096] = "风险投资公司地质学家",
		[12921] = "被激怒的污林熊怪",
		[1108] = "猩猩",
		[8890] = "铁怒狱卒",
		[8922] = "巨型血犬",
		[4494] = "血色缚法者",
		[9018] = "审讯官格斯塔恩",
		[4542] = "大检察官法尔班克斯",
		[1144] = "未知目标",
		[1152] = "钳嘴鳄鱼",
		[4654] = "玛洛迪斥候",
		[1176] = "坑道鼠征粮官",
		[4718] = "滑刃智者",
		[1188] = "灰斑黑熊",
		[9562] = "赫林迪斯·河角",
		[4798] = "腐根巡影者",
		[4814] = "暮光元素法师",
		[4846] = "暗炉掘地工",
		[9818] = "黑手召唤师",
		[4958] = "不散的怨灵 <我爱吃虾片>",
		[14041] = "哈格尔",
		[5134] = "约尼维拉·远山",
		[1296] = "菲德尔·斯托弗",
		[10394] = "黑衣守卫斥候",
		[10426] = "红衣审查者",
		[5262] = "格罗多克大猩猩",
		[5358] = "未知目标",
		[5422] = "沙漠猎食蝎",
		[10938] = "未知目标",
		[1376] = "贝尔丁·钢架",
		[1380] = "未知目标",
		[1400] = "湿地鳄鱼",
		[11258] = "脆弱的骷髅",
		[11290] = "烂苔僵尸",
		[11322] = "燃刃信徒",
		[5710] = "预言者迦玛兰",
		[11450] = "戈多克掠夺者",
		[11578] = "旋风切割者",
		[5806] = "树人盟友",
		[5822] = "斯考恩",
		[5854] = "重型作战傀儡",
		[11738] = "掠沙蜘蛛",
		[1476] = "哈金·穆达尔",
		[5982] = "黑色屠戮者",
		[1520] = "断骨士兵",
		[12218] = "邪恶幼虫",
		[12250] = "流亡者塞达尔",
		[1536] = "血色传教士",
		[1544] = "邪鳍先知",
		[6190] = "恶鞭战士",
		[8539] = "无眼观察者",
		[6350] = "玛科尼锐爪龙虾人",
		[12922] = "小鬼爪牙",
		[8891] = "铁怒卫士",
		[8923] = "无敌的潘佐尔",
		[9019] = "达格兰·索瑞森大帝",
		[6606] = "监工格里比",
		[1656] = "萨尔曼·阿加曼德",
		[1664] = "瓦松队长",
		[13338] = "熔核鼠",
		[1688] = "夜行雌蜘蛛",
		[9499] = "普拉格",
		[9691] = "毒尖蝎",
		[6910] = "鲁维罗什",
		[9819] = "黑手老兵",
		[7022] = "毒鞭蝎",
		[7038] = "索瑞森密探",
		[10043] = "雷布里的亲信",
		[7086] = "被诅咒的软泥怪",
		[14234] = "没有爪子的龙",
		[1784] = "骷髅巫师",
		[1788] = "骷髅军官",
		[1796] = "冰冷的食尸鬼",
		[1804] = "哀嚎的死者",
		[10363] = "达基萨斯将军",
		[7246] = "沙怒暗影猎手",
		[1816] = "生病的灰熊",
		[10491] = "复活的骷髅守卫",
		[1832] = "血色占星师",
		[7342] = "骷髅召唤者",
		[7358] = "寒冰之王亚门纳尔",
		[10683] = "群居孵化者",
		[1852] = "召唤者阿拉基",
		[7438] = "冬泉巨熊怪",
		[7454] = "狂暴枭兽",
		[1868] = "鸦爪仆从",
		[1884] = "血色伐木工",
		[1888] = "达拉然卫士",
		[1892] = "月怒守卫",
		[1896] = "月怒长者",
		[1912] = "达拉然保卫者",
		[11291] = "不死的烂苔巨魔",
		[11323] = "燃刃执行者",
		[7726] = "恐怖图腾博学者",
		[11451] = "荒野萨特",
		[11483] = "法力残渣",
		[11611] = "骑士杜尔根",
		[11675] = "雪盲唤风者",
		[1976] = "暴风城巡逻兵",
		[11739] = "石行蜘蛛",
		[1984] = "韩商言",
		[12219] = "尖刺鞭笞者",
		[4111] = "砂齿狗头人",
		[4127] = "乱齿土狼",
		[4255] = "布罗古斯·雷酒",
		[8540] = "破碎尖啸者",
		[4287] = "血色豪侠",
		[4303] = "血色修士",
		[8636] = "守护者莫塔加亚",
		[4351] = "血沼迅猛龙",
		[8892] = "铁怒步兵",
		[13019] = "火刃先知",
		[4479] = "法迪尔·达比雷",
		[2248] = "洞穴雪人",
		[4511] = "风月连城",
		[2272] = "达拉然法师",
		[2304] = "达伦·铁山上尉",
		[4655] = "玛洛迪争斗者",
		[2344] = "丹加洛克巡山人",
		[4719] = "滑刃海巫",
		[2368] = "刺脊捕猎者",
		[2376] = "碎鳍智者",
		[2384] = "饥饿的山地狮",
		[9596] = "班诺克·巨斧",
		[4815] = "巨钳黑泥龙虾人",
		[4831] = "萨利维丝",
		[9692] = "血斧袭击者",
		[2432] = "达尔拉·哈瑞斯",
		[2440] = "醉酒的劫匪",
		[2448] = "未知目标",
		[5055] = "变异鞭笞者",
		[2552] = "枯木巨魔",
		[2560] = "高地长尾龙",
		[10268] = "奴役者基兹鲁尔",
		[2584] = "激流堡防御者",
		[2592] = "顽石流放者",
		[5263] = "阿塔莱木乃伊",
		[2640] = "邪枝巫医",
		[2648] = "邪枝精英卫兵",
		[2656] = "玉石软泥怪",
		[2680] = "邪枝狼崽",
		[10812] = "大十字军战士达索汉",
		[5423] = "沙漠鞭尾蝎",
		[10876] = "亡灵甲虫 <奈鲁布恩坎>",
		[5455] = "森提帕尔异种蝎",
		[2736] = "巨型石元素",
		[2760] = "未知目标",
		[5615] = "废土游荡者",
		[5647] = "沙怒猎头者",
		[11324] = "燃刃术士",
		[5711] = "可悲的奥戈姆",
		[11452] = "荒野游荡者",
		[11484] = "畸形残渣",
		[11516] = "木喉游荡者",
		[5775] = "永生者沃尔丹",
		[5807] = "小猫咪",
		[5839] = "黑铁地质学家",
		[5855] = "熔岩元素",
		[11740] = "掘泥打击者",
		[2944] = "索格伦",
		[2960] = "草原狼前锋",
		[2976] = "风险投资公司苦力",
		[6047] = "水中护卫",
		[12220] = "蟒藤",
		[6143] = "阿考洛克的仆从",
		[6175] = "约翰·特纳",
		[8317] = "阿塔莱死亡行者的灵魂 <阿塔莱死亡行者>",
		[3128] = "库尔提拉斯水手",
		[8477] = "骷髅仆从 <亡首通灵师>",
		[8541] = "憎恨吟唱者",
		[6351] = "风暴海湾智者",
		[8637] = "黑铁巡逻兵",
		[12860] = "杜瑞尔·月火",
		[3232] = "刺背干涉者",
		[3240] = "雷角蜥蜴",
		[8893] = "铁怒士兵",
		[3256] = "赤鳞镰爪龙",
		[8957] = "怒爪灰熊",
		[3272] = "科卡尔牧民",
		[6559] = "粘稠的软泥怪",
		[6575] = "血色预备兵",
		[13276] = "荒野小鬼",
		[3376] = "巴尔丹士兵",
		[3392] = "勘察员卡兹戈姆",
		[13596] = "洛特格里普",
		[3416] = "草原狮后",
		[3424] = "皮皮蛇",
		[9693] = "血斧招魂师",
		[3456] = "钢鬃探路者",
		[3472] = "瓦希塔帕恩",
		[7023] = "黑曜石哨兵",
		[7039] = "战争掠夺者",
		[10077] = "狼",
		[3560] = "治疗结界 <石窟智者>",
		[7135] = "地狱火保镖",
		[14396] = "伊莫塔尔之眼 <伊莫塔尔>",
		[7247] = "沙怒噬魂者",
		[3632] = "变异爬行者",
		[3640] = "大型软浆怪",
		[7327] = "枯萎战士",
		[7343] = "碎骨骷髅",
		[14748] = "邪枝绑架者",
		[10717] = "时光寄生虫",
		[3712] = "怒尾纳迦",
		[7439] = "冬泉萨满祭司",
		[7455] = "猫头鹰",
		[10877] = "信使考雷·落锤",
		[3784] = "裂木沼泽兽",
		[11101] = "法力之潮图腾 III <Aesy>",
		[3824] = "幽爪嗥叫者",
		[3840] = "尖牙德鲁伊",
		[7727] = "恐怖图腾萨满祭司",
		[3872] = "死亡之誓",
		[11453] = "荒野欺诈者",
		[11517] = "奥格弗林特",
		[7855] = "南海海盗",
		[3944] = "怒尾女祭司",
		[3976] = "血色十字军指挥官莫格莱尼",
		[11837] = "蛮爪萨满祭司",
		[3992] = "风险投资公司工程师",
		[8015] = "灰谷哨兵",
		[4016] = "灵龙",
		[4024] = "血怒杀戮者",
		[8095] = "苏利萨斯沙行者",
		[8127] = "安图苏尔",
		[12221] = "毒性软泥怪",
		[4096] = "加拉克逐风者",
		[4112] = "砂齿歹徒",
		[4128] = "乱齿捕猎者",
		[8318] = "阿塔莱奴隶",
		[8510] = "阿塔莱图腾 <祖罗>",
		[8542] = "死亡歌手",
		[4288] = "血色驯兽员",
		[4304] = "血色捕猎犬",
		[4352] = "血沼尖啸龙",
		[8894] = "铁怒医师",
		[13021] = "扭木摧毁者",
		[4480] = "科娜塔·达比雷",
		[4512] = "楚楚",
		[4656] = "玛洛迪虐待者",
		[13437] = "空军指挥官艾克曼",
		[9502] = "法拉克斯",
		[4832] = "梦游者克尔里斯",
		[4848] = "暗炉暗法师",
		[10046] = "贝塞尼·火锤",
		[10078] = "特罗斯巴克",
		[5056] = "变异尖牙风蛇",
		[14365] = "抓贼者扎克·远山",
		[14397] = "法力脉冲 <畸形残渣>",
		[5184] = "塞拉摩哨兵",
		[10398] = "图萨丁暗影法师",
		[10430] = "比斯巨兽",
		[5232] = "未知目标",
		[14621] = "工头玛托留斯",
		[5280] = "噩梦龙族",
		[5296] = "狂暴的怒痕雪人",
		[10814] = "多彩精英卫士",
		[5424] = "沙漠疾行蝎",
		[5456] = "森提帕尔毒刺蝎",
		[5472] = "砂槌执行者",
		[5600] = "戴兹帕可汗",
		[5616] = "废土窃贼",
		[11262] = "奥妮克希亚雏龙",
		[5648] = "沙怒暗影法师",
		[5680] = "被俘虏的男人",
		[5712] = "祖罗",
		[11454] = "荒野背叛者",
		[11486] = "托塞德林王子",
		[11518] = "祈求者耶戈什",
		[11582] = "通灵学院黑暗召唤师",
		[11614] = "血箭",
		[5856] = "晶网蜘蛛",
		[11838] = "蛮爪秘法师",
		[5984] = "饥饿的弯牙土狼",
		[6016] = "防护元素图腾 <燃棘巫医>",
		[12222] = "爬行污泥怪",
		[8319] = "噩梦雏龙",
		[8447] = "科朗克",
		[8543] = "缝合憎恶",
		[8607] = "腐烂淤泥怪",
		[8671] = "拍卖师巴克尔",
		[8895] = "铁怒军官",
		[8927] = "黑暗尖啸者",
		[8959] = "魔爪狼",
		[13118] = "红衣保镖",
		[9119] = "穆尔金",
		[13438] = "空军指挥官斯里多尔",
		[6784] = "卡尔文·蒙泰古",
		[9695] = "死鞭蝎",
		[7040] = "黑色龙人",
		[7120] = "加德纳尔术士",
		[14398] = "艾德雷斯精龙",
		[10399] = "图萨丁侍僧",
		[10463] = "尖叫的女妖",
		[10495] = "生病的食尸鬼",
		[7328] = "枯萎掠夺者",
		[7344] = "碎骨战士",
		[7360] = "丹加洛克士兵",
		[7376] = "暗影鹫",
		[7440] = "冬泉巢穴守卫",
		[7456] = "猫头鹰",
		[10943] = "腐朽的守护者",
		[7664] = "污染者拉瑟莱克",
		[11263] = "未知目标 <鬼灵导师>",
		[11455] = "荒野魔仆",
		[11487] = "卡雷迪斯镇长",
		[11551] = "通灵魔",
		[7856] = "南海劫掠者",
		[7872] = "亡首教徒",
		[11839] = "蛮爪士兵",
		[12127] = "雷矛卫兵",
		[12223] = "洞窟潜伏者",
		[4097] = "加拉克狂怒者",
		[2057] = "胡达尔",
		[4129] = "乱齿狂吠者",
		[8384] = "神庙深渊潜伏者",
		[2105] = "巡山人多克金",
		[4257] = "兰纳·雷酒",
		[4273] = "守护者奥达努斯",
		[4289] = "血色招魂师",
		[8896] = "暗炉农夫",
		[8928] = "洞穴雷霆蜥蜴",
		[2241] = "辛迪加窃贼",
		[2249] = "凶恶的雪人",
		[9024] = "控火师罗格雷恩",
		[2265] = "希尔斯布莱德见习铁匠",
		[2305] = "工头邦德斯",
		[4657] = "玛洛迪逐风者",
		[13439] = "空军指挥官维波里",
		[2345] = "丹加洛克火枪手",
		[2369] = "刺脊滩行者",
		[2377] = "碎鳍潮行鱼人",
		[2385] = "断牙",
		[9568] = "维姆萨拉克",
		[2417] = "守财奴格雷尔伯格",
		[9696] = "血斧座狼",
		[2449] = "平民维尔克斯",
		[4977] = "软壳黑泥龙虾人",
		[2505] = "海龟",
		[2529] = "阿鲁高之子",
		[2553] = "枯木暗影法师",
		[2561] = "高地猎兽龙",
		[2569] = "石拳虐待者",
		[14399] = "奥术洪流",
		[2585] = "激流堡仲裁者",
		[10400] = "图萨丁亡灵法师",
		[10432] = "维克图斯",
		[10464] = "哀嚎的女妖",
		[2641] = "邪枝猎头者",
		[2649] = "枯木割颅者",
		[2657] = "训练有素的锋喙狮鹫",
		[2681] = "邪枝巨狼",
		[10816] = "游荡的骷髅",
		[5425] = "饥饿的疱爪土狼",
		[2729] = "老峭壁山狗",
		[5473] = "砂槌食人魔法师",
		[2761] = "水浪流放者",
		[11200] = "骷髅 <一切为了>",
		[5617] = "废土暗法师",
		[5649] = "沙怒饮血者",
		[5681] = "被俘虏的女人",
		[5713] = "加什尔",
		[11456] = "荒野暗影行者",
		[11488] = "伊琳娜·暗木",
		[5761] = "变异蹒跚者",
		[11552] = "木喉秘法师",
		[11616] = "纳萨尼尔·杜马",
		[2929] = "野蛮的枭兽",
		[11744] = "灰尘风暴",
		[2945] = "莫达洛克",
		[5921] = "大地之力图腾 II",
		[5985] = "弯牙土狼",
		[6017] = "熔岩喷射图腾 <石窟智者>",
		[12096] = "雷矛军需官",
		[12128] = "红衣精英",
		[12224] = "洞窟游荡者",
		[8257] = "小软泥怪",
		[6193] = "恶鞭尖啸者",
		[3113] = "钢鬃传令兵",
		[12480] = "梅里斯·玛拉甘",
		[8545] = "憎恶",
		[12896] = "银翼哨兵",
		[3249] = "巨型雷鹰",
		[6513] = "安戈洛巨猩猩",
		[8961] = "魔爪掠夺者",
		[3273] = "科卡尔召雷师",
		[9025] = "洛考尔",
		[13216] = "盖尔丁",
		[13280] = "海多斯博恩",
		[9217] = "尖石首席法师",
		[3377] = "巴尔丹火枪手",
		[3385] = "塞拉摩水兵",
		[3393] = "法莫斯队长",
		[9537] = "霍尔雷·黑须",
		[13696] = "诺克赛恩幼体",
		[9697] = "巨型灰烬座狼",
		[3457] = "钢鬃捕猎者",
		[7025] = "黑石士兵",
		[7041] = "火鳞龙人",
		[3529] = "月怒盔甲师",
		[10081] = "灰尘怨灵",
		[10177] = "黑石塔甲虫",
		[7153] = "死木战士",
		[14400] = "奥术回馈者",
		[3633] = "变异屠戮者",
		[3641] = "变异潜伏者",
		[7329] = "枯萎野猪人守卫",
		[3673] = "瑟芬迪斯",
		[3713] = "怒尾御浪者",
		[7441] = "冬泉图腾师",
		[7457] = "游荡的冰蓟雪人",
		[3809] = "米宠熊",
		[3825] = "幽爪前锋",
		[3833] = "塞纳里奥辩护者",
		[3857] = "影牙暴食者",
		[3873] = "痛苦的文官",
		[11457] = "荒野唤魔者",
		[11489] = "特迪斯·扭木",
		[7809] = "邪枝伏击者",
		[11553] = "木喉折木者",
		[3921] = "蓟皮巨熊怪",
		[7857] = "南海码头工人",
		[7873] = "剃刀沼泽护卫者",
		[11777] = "暗影碎片巡游者",
		[3977] = "大检察官怀特迈恩",
		[11873] = "鬼魅随从",
		[4001] = "风剪坑道鼠",
		[11937] = "恶魔之门的卫士",
		[4017] = "机敏的灵龙",
		[4025] = "血怒伏击者",
		[4041] = "炭色石化蜥蜴",
		[12129] = "奥妮克希亚守卫",
		[4073] = "XT:4",
		[12225] = "被诅咒的塞雷布拉斯",
		[4130] = "异种搜寻者",
		[12481] = "加斯汀·德玛利",
		[1057] = "龙喉白骨守卫",
		[1061] = "甘祖拉恩",
		[1069] = "深红雏龙",
		[1073] = "阿什兰·暗石",
		[4306] = "血色拷问者",
		[1085] = "豹",
		[1097] = "风险投资公司技工",
		[12897] = "银翼战士",
		[1109] = "木木",
		[8898] = "铁怒队长",
		[4466] = "邪枝割颅者",
		[9026] = "征服者派隆",
		[6377] = "雷首翼鹿",
		[5135] = "斯瓦尔布莱德·远山",
		[7286] = "未知目标",
		[7108] = "碧火背叛者",
		[2404] = "铁匠维林坦",
		[6125] = "哈达尔萨特",
		[1173] = "坑道鼠斥候",
		[6493] = "幻象之影",
		[13577] = "雷矛山羊骑兵指挥官",
		[1778] = "凶猛的灰斑熊",
		[13601] = "工匠吉兹洛克",
		[9046] = "裂盾军需官",
		[1197] = "碎石怪萨满祭司",
		[1201] = "雪豹",
		[4818] = "盲光鱼人",
		[1770] = "月怒夜行者",
		[4850] = "石窟潜伏者",
		[2240] = "辛迪加劫匪",
		[3863] = "暗牙恐狼",
		[7524] = "痛苦的上层精灵",
		[3763] = "魔草巡影者",
		[1846] = "保卫者洛瑞克",
		[1826] = "血色法师",
		[4962] = "“干柴”塔伯克·贾恩",
		[4978] = "阿库麦尔的仆从",
		[1802] = "饥饿的鬼魂",
		[1772] = "腐皮巡林者",
		[1822] = "毒雾潜伏者",
		[10082] = "泽雷利斯",
		[5058] = "警戒座狼 <影牙狼人卫兵>",
		[1780] = "苔藓阔步者",
		[7433] = "霜刃雌豹",
		[2360] = "希尔斯布莱德雇农",
		[1860] = "马克洛斯",
		[766] = "纠缠恐兽",
		[2831] = "巨型秃鹫",
		[1658] = "达高尔队长",
		[4003] = "风剪地占师",
		[3928] = "腐烂的泥浆怪",
		[13617] = "雷矛兽栏管理员",
		[5234] = "戈杜尼虐待者",
		[10498] = "鬼灵导师",
		[1548] = "被诅咒的黑暗犬",
		[10487] = "复活的保卫者",
		[2859] = "盖尔",
		[7941] = "玛德拉克·绿井",
		[10761] = "恐怖图腾抢夺者",
		[7357] = "火眼莫德雷斯",
		[5362] = "北泉鹰身人",
		[2931] = "一布鲁诺一",
		[6527] = "焦油爬行者",
		[6521] = "有生烈焰",
		[5426] = "疱爪土狼",
		[10882] = "阿利卡拉",
		[5458] = "森提帕尔工蝎",
		[10946] = "掠夺者霍古斯",
		[5490] = "长瘤的灌木兽",
		[1434] = "米奈希尔哨兵",
		[15137] = "米奈希尔精英",
		[10316] = "黑手监禁者",
		[15201] = "暮光烈焰掠夺者",
		[8903] = "铁怒上尉",
		[2739] = "暗炉隧道工",
		[5305] = "乱羽鸣天者",
		[5618] = "废土强盗",
		[2635] = "老海鳄",
		[5650] = "沙怒巫医",
		[1417] = "湿地鳄鱼幼崽",
		[5682] = "达林·弗治维特",
		[6487] = "奥法师杜安",
		[5714] = "洛若尔",
		[11458] = "僵化的树人",
		[11490] = "瑟雷姆·刺蹄",
		[5762] = "弱毒飞蛇",
		[2691] = "高原前锋",
		[2727] = "狼",
		[2743] = "暗炉战士",
		[2647] = "邪枝噬魂者",
		[7126] = "加德纳尔猎犬",
		[5858] = "巨型熔岩蜘蛛",
		[11746] = "沙漠奔行者",
		[11778] = "暗影碎片击碎者",
		[2919] = "法姆雷托守护者",
		[13257] = "莫高特·深炉",
		[2623] = "上古之魂 <达拉然法师>",
		[2256] = "破碎岭执行者",
		[2559] = "高地阔步龙",
		[4855] = "石窟争斗者",
		[685] = "荆棘谷迅猛龙",
		[1505] = "夜行蜘蛛",
		[12179] = "被折磨的哨兵",
		[12098] = "萨弗隆先驱者",
		[6066] = "陷地图腾 <安图苏尔>",
		[3999] = "风剪掘地工",
		[1525] = "腐烂的死者",
		[1529] = "可怕的血僵尸",
		[12258] = "锐刺鞭笞者",
		[1537] = "血色狂热者",
		[12322] = "奎尔林斯保卫者",
		[1545] = "邪鳍泥浆鱼人",
		[6194] = "恶鞭毒蛇守卫",
		[12418] = "戈多克土狼",
		[1557] = "老迈的迷雾谷猩猩",
		[1561] = "血帆袭击者",
		[2427] = "狱卒埃斯顿",
		[1924] = "月怒血啸者",
		[1164] = "碎石怪断骨者",
		[9236] = "暗影猎手沃什加斯",
		[6132] = "剃刀沼泽仆从",
		[3258] = "刺背猎手",
		[7460] = "冰蓟雪人王",
		[4461] = "黑腮战士",
		[8675] = "地狱兽",
		[2260] = "辛迪加潜行者",
		[1130] = "一袋米",
		[4666] = "火刃魔仆",
		[10759] = "恐怖图腾践踏者",
		[595] = "血顶猎人",
		[2644] = "邪枝剥皮者",
		[8899] = "厄炉龙骑兵",
		[6514] = "未知目标",
		[1834] = "血色圣骑士",
		[68] = "暴风城卫兵",
		[9027] = "修行者高罗什",
		[2408] = "海龟",
		[11982] = "玛格曼达",
		[8925] = "掘泥虫",
		[1657] = "代弗林·阿加曼德",
		[13282] = "诺克赛恩",
		[9219] = "尖石屠夫",
		[7883] = "安德雷·费尔比德",
		[1040] = "沼泽爬行者",
		[1196] = "冰爪熊",
		[13442] = "大德鲁伊雷弗拉尔",
		[5844] = "黑铁奴隶贩子",
		[1689] = "齐天大圣",
		[1693] = "洛克鳄",
		[1038] = "龙喉暗影守卫",
		[12242] = "玛拉多斯",
		[7118] = "加德纳尔暗法师",
		[11558] = "克尔达",
		[1713] = "豹",
		[7273] = "加兹瑞拉",
		[12050] = "雷矛防御者",
		[4038] = "燃烧的破坏者",
		[588] = "血顶斥候",
		[3265] = "钢鬃猎手",
		[1785] = "恐惧骸骨",
		[1809] = "食腐秃鹫",
		[9859] = "拍卖师林姆克",
		[9037] = "格鲁雷尔",
		[1753] = "蛆眼",
		[7026] = "黑石巫师",
		[7042] = "黑色龙族",
		[1765] = "座狼",
		[1769] = "月怒白头狼人",
		[10083] = "狂爪火鳞龙人",
		[7106] = "碧火潜行者",
		[1817] = "生病的狼",
		[7138] = "铁木游荡者",
		[7154] = "死木园丁",
		[1793] = "腐烂的食尸鬼",
		[1797] = "巨型灰斑熊",
		[8336] = "哈卡莱挖掘者",
		[1805] = "血肉傀儡",
		[10371] = "狂爪队长",
		[3454] = "炮兵斯密瑟",
		[10435] = "巴瑟拉斯镇长",
		[1821] = "腐虫潜伏者",
		[10499] = "鬼灵研究员",
		[10811] = "档案管理员加尔福特",
		[1833] = "血色骑士",
		[7346] = "碎骨百夫长",
		[1841] = "血色刽子手",
		[10659] = "深蓝雏龙",
		[7786] = "祖穆拉恩骷髅",
		[1853] = "黑暗院长加丁",
		[4283] = "血色哨兵",
		[7442] = "冬泉探路者",
		[7458] = "冰蓟雪人",
		[1869] = "鸦爪勇士",
		[13297] = "斯托哈德中尉",
		[5259] = "阿塔莱巫医",
		[10947] = "达隆郡背叛者",
		[10979] = "血色猎犬",
		[1889] = "达拉然巫师",
		[11043] = "红衣僧侣",
		[11075] = "护锅者拜尔摩",
		[4457] = "黑腮强盗",
		[3255] = "赤鳞尖啸龙",
		[9043] = "裂盾步兵",
		[3770] = "冷心捕猎者",
		[8929] = "铁炉堡公主茉艾拉·铜须",
		[4979] = "塞拉摩卫兵",
		[3855] = "影牙魔魂狼人",
		[5930] = "瑞雯",
		[3455] = "炮兵维桑恩",
		[905] = "利齿狂鱼",
		[1941] = "腐皮盗墓贼",
		[11459] = "埃隆巴克保护者",
		[7114] = "加德纳尔执行者",
		[1953] = "湖岸潜藏者",
		[11555] = "独眼高恩",
		[7787] = "沙怒奴隶",
		[7858] = "南海流氓",
		[7874] = "剃刀沼泽织棘者",
		[3252] = "异种群居蝎",
		[696] = "劈颅掷斧者",
		[10608] = "血色神父",
		[1985] = "大鱼",
		[5299] = "残忍的怒痕雪人",
		[2730] = "疯狂的峭壁山狗",
		[1997] = "鸟扑",
		[10916] = "冬泉信使",
		[10601] = "乌洛克惩戒者",
		[4302] = "血色勇士",
		[3924] = "蓟皮萨满祭司",
		[3257] = "伊沙姆哈尔",
		[4633] = "科卡尔斥候",
		[12099] = "火誓者",
		[3121] = "杜隆塔尔猛虎",
		[4113] = "砂齿掘地工",
		[10605] = "血色医护员",
		[10461] = "瘟疫虫",
		[12259] = "基赫纳斯",
		[4099] = "加拉克掠夺者",
		[4281] = "血色斥候",
		[12352] = "血色骑兵",
		[4147] = "盐石蜥蜴",
		[8324] = "阿塔莱骷髅 <祖罗>",
		[8905] = "战斗傀儡",
		[11197] = "无脑的骷髅 <瑞文戴尔男爵>",
		[14363] = "抓贼者格雷·铁钻",
		[4414] = "暗牙毒蜘蛛",
		[12579] = "血怒撕裂者",
		[5722] = "哈扎斯",
		[8548] = "邪恶导师",
		[8580] = "阿塔拉利恩",
		[4467] = "邪枝占卜者",
		[4323] = "灼热龙崽",
		[10429] = "大酋长雷德·黑手 <盖斯>",
		[4355] = "血沼镰爪龙",
		[2335] = "波恩塞德镇长",
		[4387] = "枯藤沼泽兽",
		[12899] = "埃克托兹",
		[1549] = "饥饿的黑暗犬",
		[7947] = "薇薇安娜",
		[8900] = "厄炉魔匠",
		[8932] = "钻孔甲虫",
		[2242] = "辛迪加间谍",
		[2250] = "山岭雪人",
		[9028] = "格里兹尔",
		[2266] = "希尔斯布莱德农夫",
		[2274] = "暴怒的斯坦利",
		[4465] = "邪枝标枪手",
		[9156] = "弗莱拉斯大使",
		[10339] = "盖斯",
		[2306] = "巴隆·瓦杜斯",
		[4627] = "阿鲁高的虚空行者",
		[4852] = "石窟智者",
		[4659] = "玛洛迪掠夺者",
		[13443] = "树林德鲁伊",
		[2346] = "丹加洛克牧师",
		[2354] = "邪恶的灰熊",
		[8526] = "黑暗法师",
		[9476] = "卫兵杜格瑞普",
		[8558] = "地穴屠戮者",
		[2386] = "南海镇卫兵",
		[8606] = "腐朽软泥怪",
		[4803] = "黑暗深渊智者",
		[4819] = "盲光泥居者",
		[14370] = "尸虫",
		[4851] = "石窟嚼石者",
		[2434] = "暗影刺客",
		[4481] = "马塞尔·达比雷",
		[2450] = "矿工哈克特",
		[2650] = "枯木狂热者",
		[9860] = "萨莉亚",
		[4361] = "黑鳍泥浆鱼人",
		[10577] = "墓穴甲虫 <地穴恶魔>",
		[9956] = "暗炉持火者",
		[3225] = "堕落的杂斑野猪",
		[8562] = "烂苔食尸者",
		[8926] = "深渊钉刺者",
		[8958] = "熊",
		[3269] = "钢鬃地卜师",
		[3281] = "萨科斯",
		[14275] = "塔尔玛·雷矛",
		[2554] = "枯木掷斧者",
		[2562] = "石拳食人魔",
		[5139] = "库德拉姆·麦须",
		[2578] = "山地秃鹰幼崽",
		[2586] = "辛迪加路霸",
		[10372] = "狂爪火舌龙人",
		[2602] = "鲁尔·巨石",
		[10436] = "安娜丝塔丽男爵夫人",
		[5235] = "真菌软泥怪",
		[10500] = "鬼灵教师",
		[5267] = "阿塔莱行尸",
		[5283] = "噩梦游荡者",
		[10596] = "烟网蛛后",
		[2658] = "锋喙狮鹫",
		[10660] = "深蓝龙崽",
		[3655] = "疯狂的马格利什",
		[5363] = "北泉游荡者",
		[10756] = "滚烫的水元素",
		[11261] = "瑟尔林·卡斯迪诺夫教授",
		[5471] = "砂槌食人魔",
		[1840] = "大检察官伊森利恩",
		[10366] = "狂爪龙人卫士",
		[5459] = "森提帕尔掘洞蝎",
		[5475] = "砂槌术士",
		[2350] = "森林食苔蛛",
		[4697] = "荒土鞭尾蝎",
		[2762] = "雷霆流放者",
		[11076] = "护锅者拉扎奇",
		[10580] = "恶臭僵尸",
		[767] = "沼泽虎",
		[11613] = "猎人莱德雷",
		[11948] = "范达尔·雷矛",
		[6907] = "埃瑞克",
		[4825] = "阿库麦尔钳嘴龟",
		[4301] = "血色百夫长",
		[4849] = "暗炉考古学家",
		[3425] = "草原徘徊者",
		[2850] = "豹",
		[5715] = "胡库",
		[11460] = "奥兹恩的爪牙",
		[11492] = "奥兹恩",
		[5763] = "噩梦软浆怪",
		[10433] = "马杜克·布莱克波尔",
		[2628] = "达拉然工人",
		[9694] = "流涎的灰烬座狼",
		[5293] = "暴怒的巨型深痕雪人",
		[5843] = "奴隶工",
		[743] = "龙族巡梦者",
		[437] = "黑石叛节者",
		[11840] = "蛮爪突击队员",
		[3926] = "蓟皮探路者",
		[5923] = "清毒图腾 <吉恩丶石蹄>",
		[11876] = "恶魔灵魂",
		[2928] = "远古枭兽",
		[11917] = "高戈地卜师",
		[1789] = "骷髅侍僧",
		[1795] = "灼热的食尸鬼",
		[5420] = "晶鳞凝视者",
		[4634] = "科卡尔虐待者",
		[12100] = "熔岩掠夺者",
		[10478] = "碎裂的骷髅",
		[7345] = "碎骨统帅",
		[3669] = "考布莱恩",
		[4847] = "暗炉发掘者",
		[6131] = "龙人施法者",
		[8197] = "克鲁纳里斯",
		[7155] = "死木探险者",
		[3750] = "污林图腾师",
		[6195] = "恶鞭海妖",
		[1837] = "未知目标",
		[3114] = "钢鬃卫兵",
		[6243] = "格里哈斯特",
		[3130] = "雷霆蜥蜴",
		[5457] = "森提帕尔群居蝎",
		[12261] = "被感染的烂苔巨魔",
		[2319] = "辛迪加巫师",
		[1893] = "月怒哨兵",
		[12676] = "沙普塔隆",
		[7272] = "殉教者塞卡",
		[5721] = "德姆塞卡尔",
		[2630] = "地缚图腾 <冬泉图腾师>",
		[6519] = "焦油兽王",
		[5857] = "灼热熔岩蜘蛛",
		[7768] = "枯木血虫",
		[12900] = "索姆努斯",
		[2590] = "辛迪咒术师",
		[4005] = "深苔爬行者",
		[8901] = "铁怒预备兵",
		[8933] = "洞穴爬行者",
		[3266] = "钢鬃防御者",
		[3274] = "科卡尔驯犬者",
		[3282] = "风险投资公司雇佣兵",
		[4009] = "狂怒的峭壁雷鸣蜥蜴",
		[727] = "铁炉堡巡山人",
		[13022] = "抽笞者",
		[9157] = "血瓣花",
		[11781] = "琥珀碎片摧毁者",
		[4057] = "塞纳留斯的儿子",
		[8120] = "苏利萨斯憎恶",
		[9268] = "燃棘狂战士",
		[3993] = "风险投资公司机械师",
		[2043] = "跟丫死磕",
		[4202] = "格雷苏",
		[3378] = "巴尔丹军官",
		[3386] = "塞拉摩医师",
		[9477] = "克隆软泥怪 <原生软泥怪>",
		[11473] = "艾德雷斯妖灵",
		[9541] = "黑须的亲信",
		[690] = "冷眼蜥蜴",
		[9605] = "黑石袭击者",
		[6867] = "寻迹犬",
		[3914] = "雷希戈尔",
		[9701] = "黑石塔蝎子",
		[3458] = "钢鬃先知",
		[2466] = "巡山人格拉盖姆",
		[684] = "深喉猎豹",
		[879] = "盐鳞猎人",
		[9861] = "米莱恩",
		[4274] = "吞噬者芬鲁斯",
		[7011] = "土灵碎岩者",
		[7027] = "黑石杀戮者",
		[7043] = "火鳞龙族",
		[4290] = "血色卫兵",
		[4715] = "滑刃刺尾纳迦",
		[8996] = "虚空行者",
		[7107] = "碧火欺诈者",
		[7450] = "蓬毛枭兽",
		[7139] = "铁木践踏者",
		[14308] = "费拉",
		[9042] = "维雷克",
		[10536] = "瘟疫蛆",
		[4386] = "枯藤断木者",
		[7397] = "土灵凿石者",
		[10940] = "往日的幽灵",
		[10405] = "恶疫食尸鬼",
		[7267] = "乌克兹·沙顶",
		[10469] = "通灵学院专家",
		[2356] = "老灰熊",
		[7347] = "嚼骨食尸鬼",
		[12178] = "被折磨的德鲁伊",
		[3674] = "斯卡姆",
		[5297] = "老年怒痕雪人",
		[10661] = "噬魔龙崽",
		[9040] = "多普雷尔",
		[7523] = "受难的上层精灵",
		[10757] = "沸腾的水元素",
		[7443] = "碎齿暴熊",
		[7459] = "冰蓟雪人女王",
		[1128] = "黑熊幼崽",
		[3746] = "污林卫兵",
		[8960] = "魔爪食腐狼",
		[3762] = "魔草魔仆",
		[10981] = "狼",
		[2563] = "平原狼蛛",
		[1768] = "邪鳍潮行者",
		[11077] = "护锅者玛维诺斯",
		[2370] = "刺脊尖啸者",
		[11141] = "特雷·莱弗治的灵魂",
		[597] = "未知目标",
		[4458] = "黑腮猎人",
		[9239] = "燃棘秘法师",
		[4802] = "黑暗深渊海潮祭司",
		[3850] = "巫师阿克鲁比",
		[2422] = "戈洛姆斯",
		[3866] = "邪蝠",
		[10437] = "奈鲁布恩坎",
		[11791] = "腐烂欺骗者",
		[11461] = "扭木守护者",
		[7795] = "水占师维蕾萨",
		[4811] = "暮光水占师",
		[11557] = "梅罗什",
		[3922] = "蓟皮图腾师",
		[13358] = "联盟弓箭手",
		[7734] = "伊利法尔",
		[11685] = "玛洛迪祭司",
		[9056] = "弗诺斯·达克维尔",
		[3634] = "变异捕猎者",
		[7939] = "羽月哨兵",
		[2558] = "枯木狂战士",
		[2570] = "石拳萨满祭司",
		[7209] = "未知目标 <黑曜石哨兵>",
		[4002] = "风剪凿石者",
		[10261] = "燃烧地狱犬 <裂盾术士>",
		[10809] = "石脊",
		[4026] = "血怒唤风者",
		[11657] = "莫洛克",
		[4042] = "焦黑石化蜥蜴",
		[12101] = "熔岩奔腾者",
		[667] = "劈颅战士",
		[7449] = "冰风破坏者",
		[4074] = "XT:9",
		[9637] = "灼烧图腾 <控火师罗格雷恩>",
		[8179] = "强效治疗结界 <沙怒巫医>",
		[4100] = "尖啸的鹰身人",
		[5474] = "砂槌蛮兵",
		[3631] = "变异刺鞭蛇",
		[698] = "血顶猛虎",
		[7275] = "暗影祭司塞瑟斯",
		[9201] = "尖石食人魔法师",
		[4196] = "异种蝎群",
		[3247] = "雷鹰雏鸟",
		[5834] = "风蛇",
		[731] = "虎王邦加拉什",
		[7429] = "霜槌保卫者",
		[8550] = "暗影法师",
		[4292] = "血色保卫者",
		[4308] = "自由的幽魂",
		[4324] = "灼热雏龙",
		[9029] = "剜眼者",
		[941] = "库尔森精神医师",
		[3254] = "赤鳞鞭尾龙",
		[3285] = "风险投资公司雇工",
		[9690] = "灰烬座狼",
		[4139] = "恐蝎",
		[2720] = "火烟食人魔法师",
		[8902] = "暗炉平民",
		[4468] = "玉石淤泥怪",
		[1815] = "生病的黑熊",
		[4500] = "莫格穆洛克大王",
		[9030] = "破坏者奥科索尔",
		[2054] = "病怏怏的难民",
		[4548] = "钢齿土狼",
		[7452] = "疯狂的枭兽",
		[6130] = "蓝色刃鳞龙人",
		[13285] = "死亡鞭笞者",
		[14367] = "抓贼者尼恩·雷酒",
		[3122] = "血爪鞭尾龙",
		[683] = "豹",
		[8546] = "黑暗教徒",
		[4676] = "次级地狱火",
		[4692] = "恐怖飞扑者",
		[4291] = "血色教士",
		[4299] = "血色牧师",
		[8897] = "厄炉工匠",
		[6551] = "格里什异种蝎",
		[12617] = "凯琳·斯蒂文",
		[4788] = "腐根萨特",
		[6553] = "格里什劫掠者",
		[4820] = "盲光先知",
		[13036] = "戈多克驯狼",
		[13797] = "巡山人布比罗",
		[6506] = "疾奔暴掠龙",
		[11520] = "饥饿者塔拉加曼",
		[3278] = "巫翼杀戮者",
		[3286] = "风险投资公司监督",
		[9862] = "加德纳尔军团士兵",
		[14303] = "僵硬守护者",
		[13136] = "亚什雄蝎 <被折磨的哨兵>",
		[940] = "库尔森药草师",
		[4493] = "血色复仇者",
		[6126] = "哈达尔欺诈者",
		[833] = "狼",
		[9376] = "火焰使者",
		[3250] = "异种爬行者",
		[8556] = "地穴巡逻者",
		[6499] = "铁皮魔暴龙",
		[11521] = "科多幽灵",
		[1836] = "反手一击",
		[9522] = "黑石伏击者",
		[4699] = "荒土毒尾蝎",
		[3434] = "纳克",
		[10374] = "尖塔蜘蛛",
		[10406] = "食尸抢夺者",
		[10438] = "苍白的玛勒基",
		[10470] = "通灵学院新学徒",
		[10502] = "伊露希亚·巴罗夫",
		[5268] = "铁鬃熊",
		[2642] = "邪枝暗影法师",
		[5300] = "乱羽角鹰兽",
		[5251] = "木爪捕兽者",
		[3394] = "巴拉克·科多班恩",
		[12369] = "科拉加鲁",
		[5364] = "北泉杀戮者",
		[10758] = "恐怖图腾强盗",
		[10220] = "哈雷肯",
		[9216] = "尖石军阀",
		[5428] = "大鹏",
		[5419] = "晶鳞蜥蜴",
		[5460] = "森提帕尔沙行者",
		[4813] = "暮光暗法师",
		[2567] = "石拳法师",
		[3810] = "老灰谷熊",
		[7291] = "加加恩·火锤",
		[11078] = "护锅者索瓦斯",
		[3226] = "堕落蝎",
		[11142] = "亡灵邮差",
		[6505] = "暴掠龙",
		[5295] = "暴怒的深痕雪人",
		[3279] = "巫翼伏击者",
		[565] = "疯狂的恐狼",
		[4300] = "血色巫师",
		[3998] = "风剪歹徒",
		[1885] = "血色铁匠",
		[1007] = "藓皮豺狼人",
		[5716] = "祖罗尔",
		[11462] = "扭木树人",
		[2646] = "邪枝饮血者",
		[7977] = "加莫里塔",
		[5780] = "克隆软浆怪 <吞噬软浆怪>",
		[2428] = "狱卒玛尔根",
		[11622] = "血骨傀儡",
		[5828] = "旧雨",
		[11686] = "鬼魅掠夺者",
		[5860] = "暮光黑暗萨满祭司",
		[4263] = "深苔幼蛛",
		[11782] = "琥珀碎片毁灭者",
		[4284] = "血色预言师",
		[6498] = "魔暴龙",
		[1084] = "小盐齿鳄鱼",
		[11910] = "恐怖图腾恶徒",
		[3280] = "巫翼唤风者",
		[5988] = "厚甲毒刺蝎",
		[10896] = "阿纳克·恐怖图腾",
		[6020] = "滑壳龙虾人",
		[2318] = "暗影大法师",
		[1114] = "丛林大猩猩",
		[1138] = "雪狼",
		[417] = "乌勒德鲁姆",
		[0] = "孢子之云",
		[6116] = "上层精灵的幻影",
		[12262] = "通灵塔保护者",
		[9436] = "贝尔加的产物 <贝尔加>",
		[2403] = "农夫盖兹",
		[2415] = "典狱官贝拉摩尔",
		[6196] = "恶鞭侍从",
		[1278] = "未知目标",
		[3803] = "痛苦的守卫者",
		[2348] = "老食苔蛛",
		[11030] = "无脑的亡灵",
		[3636] = "变异破坏者",
		[660] = "血顶巫医",
		[8519] = "荒芜巨浪",
		[8551] = "黑暗召唤师",
		[1033] = "残忍的软泥怪",
		[8615] = "秘银幼龙",
		[5646] = "沙怒掷斧者",
		[3671] = "安娜科德拉",
		[2583] = "激流堡猎巨魔者",
		[1032] = "黑色软泥怪",
		[578] = "鱼人斥候",
		[12902] = "洛古斯·杰特",
		[2639] = "邪枝掷斧者",
		[2667] = "懒惰结界 <莫什奥格巫医>",
		[6500] = "霸王魔暴龙",
		[6516] = "安戈洛大猩猩",
		[2759] = "赫玛图斯",
		[1824] = "瘟疫潜伏者",
		[9031] = "阿努希尔",
		[4863] = "玉脊蜥蜴",
		[2423] = "奥里登·匹瑞诺德领主",
		[8956] = "怒爪熊",
		[13139] = "指挥官拉多夫",
		[10217] = "烈焰打击图腾 <燃棘巫医>",
		[13318] = "指挥官莫塔米尔",
		[11787] = "岩孔虫",
		[3630] = "变异曲蛇",
		[9319] = "驯犬者格雷布玛尔",
		[6111] = "火焰新星图腾 II",
		[6557] = "原生软泥怪",
		[3886] = "屠夫拉佐克劳",
		[9447] = "血色典狱官",
		[1766] = "杂斑座狼",
		[454] = "撕空猎犬二狗",
		[9543] = "雷布里·斯库比格特",
		[2927] = "邪恶的枭兽",
		[686] = "鞭尾迅猛龙",
		[4799] = "腐根唤魔者",
		[1528] = "蹒跚的血僵尸",
		[1532] = "游荡的幽灵",
		[4812] = "暮光寻知者",
		[7886] = "恶鞭法师",
		[1550] = "钢尾蜥蜴",
		[10741] = "赛洛塔姆",
		[3275] = "科卡尔掠夺者",
		[3283] = "风险投资公司执行者",
		[7012] = "土灵雕刻者",
		[7028] = "黑石术士",
		[7268] = "沙怒守护者",
		[5253] = "木爪蛮兵",
		[7076] = "土灵守护者",
		[7092] = "被污染的软泥怪",
		[10119] = "沃尔查",
		[2728] = "狼",
		[10183] = "月焰图腾 <冬泉图腾师>",
		[4008] = "峭壁雷鸣蜥蜴",
	},
	["death_recap"] = {
		["show_segments"] = false,
		["enabled"] = true,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		4, -- [1]
		5, -- [2]
		[0] = 4,
		["劣质铜壳炸弹"] = 7,
		["重伤"] = 1,
		["酸液喷射"] = "噩梦龙族",
		["催眠曲"] = "弗雷斯特恩",
		["昏迷炸弹"] = "军需官兹格雷斯",
		["伏击"] = 4,
		["精神"] = 4,
		["恶魔之击"] = 4,
		["急救"] = 4,
		["六魔包"] = 8,
		["狂野风暴"] = 7,
		["灰尘力场"] = "瑟莱德丝公主",
		["复苏之风"] = 5,
		["免疫魅惑/恐惧/变形"] = 4,
		["裂盾传送门"] = "裂盾术士",
		["至高能量"] = 8,
		["喝水"] = 8,
		["速效毒药 III"] = 4,
		["清洁术"] = "曰天牛",
		["安抚心灵"] = 5,
		["乌瑟尔之光效果"] = 1,
		["横扫猛击"] = "维姆萨拉克",
		["雷霆一击"] = 1,
		["蜥蜴之矢"] = "洞穴雷霆蜥蜴",
		["加速光环"] = "铁怒监军",
		["暗影迷雾"] = "阿雷克斯·巴罗夫",
		["冰封攻击"] = 7,
		["末日降临"] = "鲁西弗隆",
		["鞭根块茎"] = 3,
		["尸爆"] = "通灵学院亡灵法师",
		["召唤仆人"] = 8,
		["装满哈卡之卵"] = 7,
		["爆炸死尸"] = "破碎的死尸 <被毁坏的死尸>",
		["防护火焰"] = 1,
		["腐烂蛋白"] = "钻孔甲虫",
		["遗弃技能：暗影"] = 8,
		["神圣太阳果"] = 1,
		["战斗狂怒"] = "暮光之锤刽子手",
		["兽群领袖"] = 11,
		["奥术冲击"] = "通灵学院管理者",
		["侦测隐形"] = 9,
		["寒冰之墓"] = "苍白的玛勒基",
		["挥砍"] = "乌克兹·沙顶",
		["石盾术"] = 1,
		["召唤复活的侍从"] = "通灵学院黑暗召唤师",
		["低吼"] = "二货不喂就跑 <冉冉酱丨>",
		["击昏"] = "吞咽者拉姆斯登",
		["火焰之盾"] = 9,
		["强效石盾"] = 1,
		["厚绒线绷带"] = 7,
		["多彩防护：自然"] = 7,
		["冰霜射击"] = "武器技师",
		["镇压"] = "噩梦镇压者",
		["锤击昏迷效果"] = 4,
		["冲击波"] = 8,
		["斩杀"] = 1,
		["自由行动"] = "挡箭牌",
		["压制"] = 1,
		["上古狂乱"] = "上古熔火恶犬",
		["熔岩镣铐"] = "加尔",
		["邪恶诅咒"] = 1,
		["水晶护体"] = 5,
		["奥术光辉"] = 8,
		["毒性钉刺"] = "腐蚀群居虫",
		["石肤术"] = 7,
		["拉格纳罗斯之手"] = "萨弗隆先驱者",
		["寒冰护体"] = 8,
		["刺破护甲"] = 4,
		["惊骇之爪"] = 1,
		["幽魂之狼"] = 7,
		["毒性箭雨"] = "诺克赛恩",
		["灵魂哀嚎"] = "鬼灵研究员",
		["震击"] = "傀儡统帅阿格曼奇",
		["培植种子"] = 7,
		["闪避"] = 4,
		["恢复法力"] = 8,
		["喂养宠物"] = 3,
		["煽动烈焰"] = "火焰行者",
		["光明之泉"] = 5,
		["慢性毒药"] = "洞穴爬行者",
		["水流喷射"] = "塞萨拉多头怪",
		["腐烂气息"] = "腐烂欺骗者",
		["生命偷取"] = "独自淋雨-灵风",
		["追踪龙类"] = 3,
		["Summon Lava Burst G"] = "熔核鼠",
		["毒蛇钉刺"] = 3,
		["鬼魅攻击"] = 4,
		["折磨"] = "查尔穆恩",
		["十字军打击"] = "血色豪侠",
		["召唤水浪幼崽"] = "海多斯博恩",
		["强化震荡射击"] = 3,
		["召唤幻象"] = "詹迪斯·巴罗夫",
		["智慧圣印"] = "冬天唧唧冷-哈霍兰",
		["血之狂热"] = 1,
		["命令圣印"] = "爸到",
		["猎人护甲充能"] = 3,
		["熊形态"] = 11,
		["强效智力"] = 7,
		["法术反制 - 沉默"] = 8,
		["上钩拳"] = "诺克赛恩",
		["风墙图腾"] = 7,
		["冰霜抗性"] = 7,
		["根基图腾"] = 7,
		["破甲攻击"] = 1,
		["死尸虫"] = "被撕裂的死尸",
		["毁坏之痛"] = "暮光之锤拷问者",
		["生命回复"] = 8,
		["变形术"] = 8,
		["火焰箭"] = "胡库的小鬼 <胡库>",
		["裂颅"] = "黑手精英",
		["Warder Despawn"] = "安图苏尔",
		["恐吓咆哮"] = "比斯巨兽",
		["圣光击"] = "血色老兵",
		["灼烧"] = 8,
		["刺破"] = "锐刺鞭笞者",
		["野性回复"] = "奥兹恩",
		["黑暗瘟疫"] = "复生的尸体",
		["雄鹰守护"] = 3,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["毒药"] = "墓穴魔",
		["复活亡灵甲虫"] = "奈鲁布恩坎",
		["制造祖尔法拉克之槌"] = 4,
		["暗影之触"] = 9,
		["倒钩之刺"] = "深渊钉刺者",
		["腐烂胆汁"] = "腐烂的石像鬼",
		["喝下治疗药水"] = "卫兵杜格瑞普",
		["拉格纳罗斯之拳"] = "暮光保镖",
		["倒钩"] = "尖刺鞭笞者",
		["德鲁伊的睡眠"] = "尖牙德鲁伊",
		["无畏"] = 1,
		["尖牙撕咬"] = "熔火恶犬",
		["雪人"] = 4,
		["惩戒之盾"] = 1,
		["生命虹吸"] = 9,
		["召唤仪式"] = "星鸽鸽",
		["弱化"] = "奥兹恩",
		["阿鲁高的礼物"] = "阿鲁高之子",
		["火焰之盾效果 IV"] = "土灵凿石者",
		["剧烈震颤"] = "熔核摧毁者",
		["法力燃烧"] = "血色教士",
		["烈焰之团"] = "铁手卫士",
		["战斗怒吼"] = 1,
		["小精灵装束"] = 3,
		["灼热之痛"] = 9,
		["哈卡酸液"] = "哈卡的后代",
		["蛆虫粘液"] = "瘟疫蛆",
		["圣光闪现"] = "驸灬马",
		["盾牌猛击"] = "奥拉夫",
		["Enrage Trigger"] = "火誓者",
		["胡库的卫士"] = "胡库",
		["群体打击"] = "巴瑟拉斯镇长",
		["急速射击"] = 3,
		["摇摆意志"] = "灰色座狼",
		["野性冲锋"] = 11,
		["坚定信念"] = 3,
		["召唤虚无行者"] = "游荡的基尔罗格之眼",
		["神圣力量"] = 4,
		["鲁西弗隆的诅咒"] = "鲁西弗隆",
		["毒蝎钉刺"] = 3,
		["风怒图腾"] = 1,
		["假死"] = 3,
		["遗弃技能：斧"] = 8,
		["能量灌注"] = 5,
		["智慧祝福"] = "驸灬马",
		["摩尔达的勇气"] = "卫兵摩尔达",
		["蛛后的乳汁"] = "烟网蛛后",
		["阿塔莱骷髅图腾"] = "祖罗",
		["灵魂分流"] = "图萨丁亡灵法师",
		["召唤暗影法师"] = "骷髅召唤者",
		["复活节糖果"] = 4,
		["力反馈盾牌"] = 1,
		["棕色骸骨军马"] = 5,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["狂热"] = 4,
		["剧痛鞭笞"] = "未知目标 <胡库>",
		["侏儒洗脑帽"] = 7,
		["盾牌专精"] = 1,
		["治疗石"] = 9,
		["召唤警戒座狼"] = "影牙狼人卫兵",
		["防护冰霜"] = 3,
		["心灵尖啸"] = 5,
		["弩射击"] = 4,
		["岩浆喷溅"] = "贝尔加",
		["火焰新星"] = "火焰新星图腾 II <吉恩丶石蹄>",
		["召唤黑曜石碎片"] = "黑曜石哨兵",
		["暴风雪"] = 8,
		["麻痹毒药 II"] = 4,
		["爆炸陷阱"] = 3,
		["地精火箭靴"] = 3,
		["胸闷"] = 5,
		["挑战咆哮"] = 11,
		["龙鳞之心"] = 4,
		["战士的决心"] = 1,
		["召唤地狱战马"] = 9,
		["投石"] = "原始巨兽",
		["月火术"] = 11,
		["猛踢"] = "指挥官沃恩",
		["神恩术"] = "东游丶西行-水晶之牙",
		["火焰风暴"] = "伊森迪奥斯",
		["学识爆发"] = 5,
		["忍者装束"] = 9,
		["哀嚎死者"] = "亡灵邮差",
		["召唤宠物"] = 3,
		["拦截昏迷"] = 1,
		["恢复生命"] = 9,
		["削骨之刃"] = 1,
		["混乱集中"] = "荒野魔仆",
		["土灵卫士被摧毁"] = "土灵管理者",
		["嚎叫之怒"] = "盲眼守卫奥杜",
		["暗影之盾"] = "阿塔莱高阶祭司",
		["恶毒之咬"] = "上古熔火恶犬",
		["丝质绷带"] = 8,
		["憎恨怒视"] = "瑟莱德丝公主",
		["醉酒怒气"] = "霍尔雷·黑须",
		["水下呼吸"] = 7,
		["斯里基克的机智"] = "卫兵斯里基克",
		["耐力"] = 4,
		["沙斯拉尔的诅咒"] = "沙斯拉尔",
		["淹没"] = "海多斯博恩",
		["无情"] = 4,
		["黑暗符文"] = 7,
		["感知恶魔"] = 9,
		["乱射"] = 3,
		["攻击"] = "灼热图腾 III <吉恩丶石蹄>",
		["Summon Lava Burst F"] = "熔核鼠",
		["麻痹毒药"] = 4,
		["逃脱"] = 3,
		["威慑"] = 3,
		["摔绊"] = 3,
		["爆发"] = "熔岩裂缝",
		["冰霜箭"] = 3,
		["!Melee"] = 4,
		["闪电"] = 4,
		["影遁"] = 3,
		["补充法力 II"] = 8,
		["多疑"] = 9,
		["回春术"] = "疯灬车车",
		["剑类武器专精"] = "夜无烟",
		["恶魔牺牲"] = 9,
		["戈多克之王"] = "米兹勒",
		["麻木之痛"] = 4,
		["飓风"] = 11,
		["强化断筋"] = 1,
		["噬灵瘟疫"] = 5,
		["强效治疗术"] = 5,
		["激流"] = "海多斯博恩",
		["Summon Lava Burst A"] = "熔核鼠",
		["救助者的牺牲"] = 1,
		["眩晕"] = 3,
		["真言术：盾"] = 5,
		["厚甲蝎之击"] = 4,
		["血性狂暴"] = 1,
		["精神矍铄"] = 3,
		["急速冲锋"] = "赫洛德",
		["重击"] = 11,
		["投网"] = "泽雷利斯",
		["随机装束"] = 4,
		["防护恐惧结界"] = "有点迟钝",
		["牺牲"] = 9,
		["恶魔耐力"] = 9,
		["割裂"] = 4,
		["搜索"] = 4,
		["泰坦合剂"] = 11,
		["圣光审判"] = "琪琪的宝宝",
		["投掷"] = 1,
		["清毒图腾"] = 7,
		["撕咬"] = "豹 <狂风怒击之炎>",
		["清算"] = 9,
		["补充法力"] = 8,
		["连发寒冰箭"] = "莱斯·霜语",
		["点燃法力"] = "迦顿男爵",
		["深冬之寒"] = 8,
		["火焰之雨"] = "欧罗·血眼",
		["次级治疗石"] = 9,
		["欺诈宝珠"] = 4,
		["生命的恩赐"] = 7,
		["灼热图腾"] = 7,
		["潜行"] = 4,
		["强化摔绊"] = 3,
		["挫志怒吼"] = 1,
		["黑暗美味朗姆酒"] = 5,
		["狂暴怒气"] = "阿库麦尔",
		["传送：幽暗城"] = "Magicg",
		["星辰碎片"] = "艾德雷斯巫师",
		["吸取生命"] = "奶茶双响炮",
		["光明美味朗姆酒"] = 1,
		["虚空箭"] = "蕾瑟塔蒂丝",
		["暗影箭雨"] = "暗炉暗法师",
		["破胆咆哮"] = "乌洛克",
		["火焰射击"] = "血色斥候",
		["法力之潮图腾"] = 7,
		["致残毒药"] = 4,
		["拉格纳罗斯之怒"] = "暮光使者",
		["物理防护"] = 4,
		["剥皮"] = 5,
		["考布莱恩毒蛇形态"] = "考布莱恩",
		["心灵之火"] = "血色牧师",
		["火球术"] = "血色教士",
		["血腥撕裂者"] = 4,
		["光明之泉回复"] = 5,
		["魔爆术"] = 8,
		["水上行走"] = 7,
		["大地践踏"] = "上古熔火恶犬",
		["致密炸弹"] = 11,
		["剑刃乱舞"] = 4,
		["治疗祷言"] = 5,
		["快速射击"] = 3,
		["断筋"] = 1,
		["魔法增效"] = 8,
		["拳击"] = 1,
		["恐怖低吼"] = "血犬",
		["恶魔符文"] = 7,
		["冰霜冲击"] = 4,
		["青色迅猛龙"] = 3,
		["恶魔皮肤"] = "沙怒暗影法师",
		["驱除疾病"] = 5,
		["敏捷提高"] = 3,
		["致死顺劈"] = "克罗卡斯",
		["鲁莽诅咒"] = 9,
		["反魔法盾"] = "剜眼者",
		["屠杀"] = "暮光之锤刽子手",
		["狂暴姿态"] = 1,
		["暗影灼烧"] = 9,
		["娜玛拉消失"] = "罗克诺特下士",
		["扰乱"] = 4,
		["往日的尖啸"] = "哀嚎的卫兵",
		["强效隐形"] = "纳克萨玛斯之眼",
		["闪电链"] = 7,
		["火印诅咒"] = "火印暗法师",
		["奥术箭"] = "暮光使者",
		["麻风侏儒装束"] = 1,
		["惩击"] = 5,
		["治疗宠物"] = 3,
		["寒冬"] = "奥兹恩",
		["大地粉碎"] = "狂热的玛洛尔",
		["屠夫吸取"] = "屠夫拉佐克劳",
		["种植林精种子"] = 7,
		["坚韧祷言"] = 5,
		["治疗之道"] = 7,
		["灵魂支配"] = 4,
		["瞄准射击"] = 3,
		["脓疮撕咬"] = "瘟疫虫",
		["岗哨图腾"] = 7,
		["召唤幻象之影"] = "鬼魅幻影",
		["防护暗影结界"] = 9,
		["先知药剂"] = 7,
		["恐惧术"] = "大检察官法尔班克斯",
		["拍翼"] = "哈卡莱挖掘者",
		["暗棕狼"] = 3,
		["恶魔践踏"] = "地狱战马",
		["恶魔支配"] = 9,
		["烈焰打击图腾"] = "燃棘巫医",
		["Drowning"] = "环境伤害 (溺水)",
		["圣盾术"] = "血色十字军指挥官莫格莱尼",
		["地精工兵炸药"] = 4,
		["被遗忘者的意志"] = 4,
		["击退"] = "艾隆纳亚",
		["召唤火元素"] = "血色咒术师",
		["无梦睡眠"] = 11,
		["还击"] = 4,
		["暴怒"] = 1,
		["暗影易伤"] = 5,
		["践踏"] = "石头看守者",
		["感染之伤"] = "祖尔法拉克阵亡英雄",
		["熔岩喷射图腾"] = "石窟智者",
		["暗言术：痛"] = 5,
		["摔投"] = "暗炉恶棍",
		["灵魂燃烧"] = "火焰之王",
		["以眼还眼"] = "胖骑-艾隆纳亚",
		["神圣太阳果汁"] = 8,
		["审判"] = "爸到",
		["瑟银盾刺"] = 1,
		["锐刺鞭笞者之根"] = 8,
		["传送到玩家"] = "奥妮克希亚雏龙",
		["专注施法"] = 5,
		["斯坦索姆圣水"] = 1,
		["速效毒药 IV"] = 4,
		["宁静之风"] = 7,
		["元素火焰"] = "拉格纳罗斯",
		["女妖哀嚎"] = "尖叫的女妖",
		["神圣之火"] = 5,
		["奥术集中"] = "鬼灵教师",
		["!Autoshot"] = 4,
		["枯萎热浪"] = "上古熔火恶犬",
		["熔岩吐息"] = "上古熔火恶犬",
		["迅捷绿色迅猛龙"] = 8,
		["枯萎毒药"] = "恐蝎劫掠者",
		["魔法抑制"] = 8,
		["抗火图腾"] = 7,
		["凿击"] = 4,
		["灼烧之焰"] = "上古熔火恶犬",
		["Lava"] = "环境伤害 (岩浆)",
		["造水术"] = 8,
		["连珠火球"] = "火焰驱逐者",
		["圣疗术"] = "血色十字军指挥官莫格莱尼",
		["庇护祝福"] = "可乐泡沫-火锤",
		["盾击 - 沉默"] = 1,
		["灵魂消耗"] = "雷希戈尔",
		["暗影守卫"] = 5,
		["速度"] = 5,
		["邪恶光环"] = "阿雷克斯·巴罗夫",
		["冰霜反射器"] = "遗忘的桔梗",
		["撕扯"] = 11,
		["盾墙"] = 1,
		["清晰预兆"] = 11,
		["抗毒药剂"] = 9,
		["迅猛龙的狡诈"] = 4,
		["撞击"] = "熔核巨人",
		["速效毒药 V"] = 4,
		["加兹瑞拉猛击"] = "加兹瑞拉",
		["强效护甲"] = 1,
		["蛛网爆炸"] = "爬行者赫杜姆",
		["愤怒"] = "被诅咒的塞雷布拉斯",
		["生命通道"] = 9,
		["幽影突袭"] = 4,
		["伤害增效"] = "骷髅暗影法师 <骷髅召唤者>",
		["自爆"] = "奥法师杜安",
		["免疫定身/缠绕/昏迷"] = 1,
		["虔诚光环"] = "血色保卫者",
		["召唤碎片"] = "兰斯利德",
		["地狱烈焰"] = 9,
		["守护效果"] = 1,
		["撕碎"] = 11,
		["破碎一击"] = "戈多克蛮兵",
		["召唤骷髅仆从"] = "亡首通灵师",
		["吐息"] = "奥妮克希亚",
		["打磨利刃 V"] = 4,
		["快速传染"] = "博学者普克尔特",
		["肾击"] = 4,
		["牺牲圣印"] = "暮光保镖",
		["狂乱"] = "玛格曼达",
		["凝视"] = "复活的畸形骷髅",
		["召唤诺克赛恩产物"] = "诺克赛恩",
		["魔甲术"] = 8,
		["魔纹绷带"] = 4,
		["缠绕之藤"] = "特迪斯·扭木",
		["无敌"] = 7,
		["火焰之花"] = "火焰行者",
		["厚丝质绷带"] = 5,
		["怒气"] = 1,
		["野性守护"] = 3,
		["火焰的召唤"] = "通灵学院亡灵法师",
		["叉状闪电"] = "尖石秘法师",
		["法术反制"] = 8,
		["暗影冥思"] = 9,
		["死亡之愿"] = 1,
		["昏迷"] = 1,
		["枭兽光环"] = 11,
		["恢复"] = 5,
		["蛮力药剂"] = 1,
		["迅捷棕狼"] = 1,
		["十字军圣印"] = "胖骑-艾隆纳亚",
		["深度沉睡"] = "伊兰尼库斯的阴影",
		["制造魔法红宝石"] = 8,
		["火舌攻击"] = 1,
		["真言术：韧"] = 5,
		["铸铁之怒"] = 1,
		["龙血酒"] = 5,
		["疲劳诅咒"] = 9,
		["荆棘术"] = "驸灬马",
		["召唤传送门"] = "哈卡莱护血者",
		["渐隐术"] = 5,
		["冷酷"] = 4,
		["次级力量"] = 1,
		["烈焰弹"] = 3,
		["凋零之触"] = "复活的守护者",
		["宁神射击"] = 3,
		["灼热武器"] = 1,
		["快速治疗"] = 5,
		["病弱"] = "掘泥虫",
		["火焰爆发"] = "伊森迪奥斯",
		["绒线绷带"] = 4,
		["闷棍"] = 4,
		["灵猴守护"] = 3,
		["制造遗物包裹"] = 11,
		["安图苏尔的治疗波"] = "安图苏尔",
		["净化术"] = 7,
		["暗影射击"] = "荒野背叛者",
		["闪电吐息"] = "风蛇",
		["巨熊形态"] = 11,
		["女妖诅咒"] = "哀嚎的女妖",
		["烈焰风暴"] = 8,
		["切割"] = 4,
		["冰冻术"] = "莱斯·霜语",
		["出血"] = 4,
		["召唤末日守卫"] = "戈多克术士",
		["心灵视界"] = 5,
		["音素爆破"] = "利齿蝙蝠",
		["灵感"] = 5,
		["黑暗祭品"] = "沙怒噬魂者",
		["自毁"] = "石头看守者",
		["火焰反射器"] = 9,
		["冬泉火酒"] = 1,
		["制造强效灵魂石"] = 9,
		["制造魔法玛瑙"] = 8,
		["血之诅咒"] = "大检察官法尔班克斯",
		["火焰打击"] = 1,
		["挑战怒吼"] = 1,
		["致伤"] = 4,
		["地狱烈焰效果"] = 9,
		["智力提高"] = 8,
		["震荡猛击"] = 1,
		["感染撕咬"] = "奴役者基兹鲁尔",
		["冰冻"] = 8,
		["毒性震击"] = "爬行污泥怪",
		["熔岩爆裂"] = "控火师罗格雷恩",
		["精神控制"] = 5,
		["召唤阿塔莱死亡行者的灵魂"] = "阿塔莱死亡行者",
		["传送：暴风城"] = "伤心乂小剑",
		["虫群"] = 11,
		["打击"] = "巴尔洛戈",
		["集中"] = 7,
		["火焰抗性"] = 7,
		["巨化术"] = "尖石首席法师",
		["狂暴怒火"] = "巴瑟拉斯镇长",
		["天神下凡"] = "范达尔·雷矛",
		["燃烧"] = 9,
		["石肤图腾"] = 7,
		["召唤机械雪人"] = 4,
		["寒冰屏障"] = 8,
		["脚踢"] = 4,
		["热疫"] = "耐克鲁姆",
		["导致疯狂"] = "哈卡的化身",
		["虚弱诅咒"] = "骷髅召唤者",
		["暗影箭"] = "血色预言师",
		["召唤"] = "血斧召唤师",
		["召唤虚空行者"] = "杜姆雷尔",
		["复活宠物"] = 3,
		["鬼魂装束"] = 5,
		["闪电之盾"] = 7,
		["枭兽形态"] = 11,
		["暗影之门"] = "黑暗院长加丁",
		["十字军之锤"] = "大十字军战士达索汉",
		["黑暗主宰诅咒"] = "黑暗院长加丁",
		["吸取法力"] = "苍白的玛勒基",
		["潜伏"] = "豹 <你丶寻欢>",
		["Summon Lava Burst E"] = "熔核鼠",
		["铁质盾刺"] = "梵天神牛",
		["银色黎明委任徽章"] = 9,
		["腐烂恶臭"] = "腐烂的普雷莫尔",
		["投掷岩石"] = 5,
		["抗寒图腾"] = 7,
		["安图苏尔的爪牙"] = "安图苏尔",
		["急奔"] = 11,
		["放逐术"] = "杜姆雷尔",
		["狂暴之怒效果"] = 1,
		["吞噬魔法"] = "诺哈索恩 <Sauora>",
		["耐普图隆的守护"] = 4,
		["受难"] = "格拉克葛蘭 <四十四个術士>",
		["萃取智慧"] = 5,
		["保护祝福"] = "Grubbydu",
		["图特卡什的诅咒"] = "图特卡什",
		["抵抗火焰"] = "裂盾缚法师",
		["恶毒撕裂"] = "剜眼者",
		["神圣之灵"] = 5,
		["闪电箭"] = "骷髅召唤者",
		["破甲顺劈"] = "拉文尼亚",
		["钻土虫酸液"] = "钻土虫",
		["召唤阿塔莱骷髅"] = "阿塔莱图腾 <祖罗>",
		["击倒"] = "洞窟潜伏者",
		["穿刺"] = "燃棘猎头者",
		["猛击"] = 1,
		["野性印记"] = 11,
		["迅捷棕色科多兽"] = 7,
		["复仇昏迷"] = 1,
		["疾病喷吐"] = "瘟疫龙崽",
		["圣佑术"] = 5,
		["守护之刺"] = 3,
		["掷斧"] = "指挥官沃恩",
		["法力护盾"] = 8,
		["鬼魅幻影"] = "鬼魂市民",
		["龙翼攻击"] = "奥妮克希亚",
		["末日决战"] = "迦顿男爵",
		["伊莫塔尔之眼"] = "伊莫塔尔",
		["抗性"] = 9,
		["暗灰狼形态"] = "奥兹恩",
		["裂筋"] = "戈多克驯狼",
		["免疫恐惧/变形/缠绕"] = 8,
		["力量"] = 1,
		["敏捷"] = 4,
		["地狱火罩"] = "石窟织炎者",
		["进食"] = 4,
		["水晶蜘蛛之牙"] = 1,
		["召唤雷德·黑手"] = "盖斯",
		["听觉震荡"] = "黑暗尖啸者",
		["冲锋击昏"] = 1,
		["猎豹守护"] = 3,
		["召唤尖塔小蜘蛛"] = "尖塔蜘蛛",
		["致命毒药"] = 4,
		["灵魂撕裂"] = "艾德雷斯鬼巫",
		["黑标美味朗姆酒"] = 1,
		["精灵之火"] = 11,
		["横扫攻击"] = 1,
		["恶魔学识大师"] = 9,
		["乱舞"] = 7,
		["残废术"] = "亡首通灵师",
		["疾病之云"] = "暴食者",
		["偷袭"] = 4,
		["分裂"] = "熔岩爪牙 <火焰之王>",
		["驱散射击"] = 3,
		["休眠"] = 11,
		["熔化护甲"] = "烈焰守卫",
		["烈焰之矛"] = "萨弗隆先驱者",
		["远古之怒"] = 4,
		["闪现术"] = 8,
		["制造灵魂石"] = 9,
		["恐惧嚎叫"] = 9,
		["野兽之眼"] = 3,
		["生命石治疗"] = "缇娜艾斯",
		["追踪恶魔"] = 3,
		["杀死乌洛克的爪牙"] = "Challenge to Urok Trap",
		["厚亚麻绷带"] = 4,
		["疾跑"] = 4,
		["根基图腾效果"] = 7,
		["缓落术"] = 8,
		["宁静之风图腾"] = 7,
		["心灵震爆"] = 5,
		["高爆炸弹"] = 4,
		["风暴打击"] = 7,
		["冰霜陷阱"] = 3,
		["龙息红椒"] = 1,
		["冲动"] = 4,
		["红色骸骨军马"] = 8,
		["暗影震击"] = "通灵学院通灵师",
		["燃烧之风"] = "档案管理员加尔福特",
		["奇特的朗姆酒"] = 4,
		["石像鬼打击"] = "石翼尖啸者",
		["震地者"] = 1,
		["刺骨暗影"] = "图萨丁暗影法师",
		["克雷格的烈酒"] = 3,
		["Summon Lava Burst H"] = "熔核鼠",
		["灵魂虹吸"] = 9,
		["免疫恐惧/变形/昏迷"] = "橘花开瓶盖",
		["燃烧之愿"] = 9,
		["狂野怒火"] = "二十几个烈人",
		["收集群居龙蛋"] = 3,
		["火舌武器"] = 7,
		["魔法反射"] = "管理者埃克索图斯",
		["惩戒痛击"] = 1,
		["灵魂撕咬"] = "沙怒噬魂者",
		["致命毒药 III"] = 4,
		["血色幻象"] = 4,
		["炉石"] = 1,
		["致死打击"] = 1,
		["净化逃脱"] = "敏恒玻璃叁-巨龙追猎者",
		["侦测魔法"] = 8,
		["召唤瑟莱德丝碎片"] = "瑟莱德丝卫士",
		["海盗装束"] = 5,
		["野猪冲锋"] = "野猪 <歧路相逢>",
		["凶猛撕咬"] = 11,
		["元素浩劫"] = 7,
		["召唤冰图腾"] = "蛮爪萨满祭司",
		["寒冰新星"] = "相位鞭笞者",
		["吸血鬼的拥抱"] = 5,
		["厄运诅咒"] = 9,
		["无情打击效果"] = 4,
		["召唤贝尔加的产物"] = "贝尔加",
		["熔岩冲击"] = "拉格纳罗斯",
		["顺劈斩"] = 1,
		["制造初级治疗石"] = 9,
		["召唤水元素"] = "红衣魔术师",
		["元素诅咒"] = 9,
		["Burning Felguard Spawn"] = "燃烧地狱卫士 <裂盾术士>",
		["次级护甲"] = 4,
		["再生"] = 7,
		["魂能之力"] = 11,
		["Summon Lava Burst D"] = "熔核鼠",
		["将军的咆哮"] = 4,
		["霜甲术"] = "白曰衣衫尽",
		["相位变换"] = "亞茲菲普 <四十四个術士>",
		["戈多克绿酒"] = 1,
		["震耳尖啸"] = "尖叫的女妖",
		["反击"] = 3,
		["槌击"] = 11,
		["畏缩"] = 11,
		["迅捷灰狼"] = 7,
		["激活"] = 11,
		["治疗之泉"] = "治疗之泉图腾 II <雾朦胧>",
		["吸取灵魂"] = 9,
		["语言诅咒"] = "哈卡的化身",
		["战栗图腾"] = 7,
		["暗影形态"] = 5,
		["Summon Lava Burst B"] = "熔核鼠",
		["奥术气泡"] = "奥法师杜安",
		["纠缠"] = "特迪斯·扭木",
		["精灵之火（野性）"] = 11,
		["十字军审判"] = "胖骑-艾隆纳亚",
		["灼烧图腾"] = "控火师罗格雷恩",
		["洛丹伦的回响"] = 1,
		["黑色腐烂"] = "瘟疫鼠",
		["冰封武器"] = 7,
		["献祭"] = "奶茶双响炮",
		["奥术强化"] = 8,
		["破甲"] = 4,
		["瘟疫之云"] = "圣甲虫",
		["地震术"] = 7,
		["血袭"] = 11,
		["厚魔纹绷带"] = 1,
		["猫鼬药剂"] = 4,
		["低沉咆哮"] = "奥妮克希亚",
		["致命毒药 IV"] = 4,
		["造食术"] = 8,
		["Fire"] = "环境伤害 (火烧)",
		["扫击"] = 11,
		["圣光术"] = "血色保卫者",
		["变异鱼大餐"] = 1,
		["恶性毒药"] = "墓穴劫掠者",
		["狂暴冲锋"] = "比斯巨兽",
		["刺穿护甲"] = "噩梦游荡者",
		["驱邪术"] = "奥里克斯",
		["心灵专注"] = 5,
		["奥术防护"] = 11,
		["冰柱"] = "加兹瑞拉",
		["妖术"] = "沙怒暗影猎手",
		["石化武器"] = 7,
		["强健灵魂"] = 8,
		["风暴之锤"] = "范达尔·雷矛",
		["生命 II"] = 1,
		["灵魂链接"] = 9,
		["怒不可遏"] = 1,
		["血红之怒"] = "艾德雷斯怨魂",
		["旋风斩效果"] = "赫洛德",
		["挫志咆哮"] = 11,
		["精神祷言"] = 5,
		["短暂强力"] = 8,
		["力量祝福"] = "教乄皇-埃提耶什",
		["亚麻绷带"] = 8,
		["包围之网"] = "阿努希尔",
		["爆炸射击"] = "血色驯兽员",
		["炽热之地"] = "奥妮克希亚",
		["治疗波"] = 7,
		["魔法吸收"] = "时迁老表",
		["召唤冰霜亡魂"] = "寒冰之王亚门纳尔",
		["大地之力"] = 7,
		["强效智慧祝福"] = "青苹蛋挞",
		["颅骨烙印"] = 4,
		["狂暴"] = 8,
		["奉献"] = "孤女安妮",
		["熔岩之盾"] = "烈焰之子",
		["投掷炸弹"] = "暗炉农夫",
		["野性暴怒"] = "影牙暴怒者",
		["致命毒药 II"] = 4,
		["狂暴回复"] = 11,
		["银色复仇者"] = 1,
		["毒性唾液"] = "吞噬者芬鲁斯",
		["愤怒之锤"] = "胖骑-艾隆纳亚",
		["风之优雅图腾"] = 7,
		["盾刺"] = "噩梦刃鳞龙人",
		["献祭陷阱效果"] = 3,
		["强效敏捷"] = 4,
		["炎爆术"] = "档案管理员加尔福特",
		["冰冻陷阱效果"] = 3,
		["缴械"] = 1,
		["痛击"] = "血色僧侣",
		["追踪隐藏生物"] = 3,
		["灼热箭"] = 3,
		["沉默"] = "奥法师杜安",
		["巨石之力"] = 1,
		["冰霜陷阱光环"] = 3,
		["节能施法"] = 8,
		["自然的慷慨"] = 11,
		["荆棘光环"] = "米杉",
		["伊森哈德之怒"] = 1,
		["荆棘箭雨"] = "尖刺鞭笞者",
		["召唤红衣火枪手"] = "炮手威利",
		["腐坏之血"] = "索乌迪姆 <沐风-沙顶>",
		["寒冰箭"] = 8,
		["冰冻陷阱"] = 3,
		["巨人药剂"] = 1,
		["制造治疗石"] = 9,
		["奥术射击"] = 3,
		["逃命专家"] = "绯红女巫",
		["治疗药水"] = 4,
		["王者祝福"] = "充气小爱人",
		["自动射击"] = 3,
		["汹涌"] = "熔岩奔腾者",
		["制裁之锤"] = "血色豪侠",
		["新近包扎"] = 4,
		["灰色科多兽"] = 1,
		["自杀"] = "黑手精英",
		["火息术"] = "霍尔雷·黑须",
		["盾牌格挡"] = 1,
		["复活节惊骇"] = 4,
		["法力回复"] = 8,
		["反手一击"] = "碎骨统帅",
		["治疗链"] = 7,
		["全力一击"] = "法拉克斯",
		["脑部损伤"] = 4,
		["Summon Lava Burst I"] = "熔核鼠",
		["恐吓"] = "变异尖牙风蛇",
		["多彩混乱"] = "维克多·奈法里奥斯",
		["水晶沉睡"] = "玉脊蜥蜴",
		["毒蛇形态"] = "尖牙德鲁伊",
		["冰霜"] = "冰图腾 <蛮爪萨满祭司>",
		["自然之握"] = 11,
		["重创"] = "深圳陈三朵",
		["灵魂石复活"] = 9,
		["绿色骸骨战马"] = 8,
		["正义圣印"] = "Maagisk",
		["铁皮手雷"] = 1,
		["恶魔能量"] = 9,
		["笨拙术"] = "影牙魔魂狼人",
		["制造次级治疗石"] = 9,
		["暗灰狼"] = 1,
		["自然迅捷"] = 7,
		["智慧审判"] = "刹那风华-莫格莱尼",
		["速效毒药 VI"] = 4,
		["剧烈痛楚"] = "瑟雷姆·刺蹄",
		["召唤错觉狼影"] = "暗牙恐狼",
		["命运"] = 1,
		["放置未淬火的剑"] = 1,
		["冲击"] = 8,
		["黑暗回复"] = "影牙狼人卫兵",
		["强化格挡"] = "血色士兵",
		["烈焰鞭笞"] = "暗炉地质学家",
		["恢复能量"] = 4,
		["霜寒刺骨"] = 8,
		["上古恐慌"] = "上古熔火恶犬",
		["战斗姿态"] = 1,
		["法术封锁"] = "诺哈索恩 <Sauora>",
		["魔纹布卷"] = 8,
		["地缚图腾"] = 7,
		["火焰冲撞"] = 9,
		["鲁莽"] = 1,
		["附魔双手武器 - 初级冲击"] = "神起神灭亅",
		["荆棘诅咒"] = "黑手恐法师",
		["免疫魅惑/恐惧/昏迷"] = 11,
		["治疗之触"] = 11,
		["进食充分"] = 4,
		["神圣打击"] = "血色勇士",
		["召唤破碎的死尸"] = "被毁坏的死尸",
		["衰弱之触"] = "鬼魂市民",
		["地狱火"] = "迦顿男爵",
		["诱捕"] = 3,
		["火焰之盾 IV"] = "石窟织炎者",
		["猫鼬撕咬"] = 3,
		["突进"] = "蛋黄",
		["重磅铁制炸弹"] = 3,
		["暗影诅咒"] = 9,
		["召唤黑手老兵"] = "黑手召唤师",
		["多重射击"] = 3,
		["先祖坚韧"] = 7,
		["统御意志"] = "伊露希亚·巴罗夫",
		["自由祝福"] = "爸到",
		["狂怒之嚎"] = 3,
		["强效奥法药剂"] = 8,
		["制造魔法黄水晶"] = 8,
		["侏儒火箭靴"] = "小灰姑娘",
		["霜狼之怒"] = 1,
		["伊莫塔尔传送门"] = "伊莫塔尔",
		["智力"] = 7,
		["精神提高"] = 11,
		["火屑弹幕"] = "熔岩元素",
		["制造特效灵魂石"] = 9,
		["阿尔萨斯的礼物"] = 1,
		["实心炸弹"] = 7,
		["静电屏障"] = 4,
		["战争践踏"] = 7,
		["缩小射线"] = 8,
		["胁迫"] = 3,
		["厚符文布绷带"] = 9,
		["防护冰霜结界"] = 8,
		["石爪图腾"] = 7,
		["正义审判"] = "东游丶西行-水晶之牙",
		["狂怒"] = "血色仆从",
		["军旗"] = 1,
		["女妖尖叫"] = "艾德雷斯鬼巫",
		["启发"] = "李铁",
		["精神分流"] = 5,
		["野猪之魂"] = 9,
		["奥特兰克泉水"] = 3,
		["烈焰火炮"] = "怒锤傀儡",
		["元素大师"] = 8,
		["筛盐器"] = 1,
		["特效治疗石"] = 9,
		["地精迫击炮"] = 8,
		["强效治疗石"] = 9,
		["扰乱射击"] = 3,
		["猎人印记"] = 3,
		["孢子之云"] = "孢子树",
		["旅行形态"] = 11,
		["迅捷橙色迅猛龙"] = 3,
		["超强治疗结界"] = "燃棘巫医",
		["追踪人型生物"] = 11,
		["黑暗契约"] = 9,
		["野性赐福"] = 11,
		["吸血一击"] = "巴瑟拉斯镇长",
		["影像投射"] = "鬼灵导师",
		["星火术"] = 11,
		["治疗术"] = 5,
		["刺耳怒吼"] = 1,
		["烈焰化身"] = "达格兰·索瑞森大帝",
		["点燃"] = 8,
		["恐吓嚎叫"] = "石翼尖啸者",
		["复生"] = 11,
		["附魔手套 - 强效敏捷"] = 8,
		["巨型喷泉"] = "海多斯博恩",
		["伤害反射护盾"] = "烈焰行者精英",
		["豹群守护"] = 3,
		["芬古斯的狂暴"] = "卫兵芬古斯",
		["飞扑"] = "哈卡莱霜翼飞蛇",
		["蝰蛇钉刺"] = 3,
		["风怒武器"] = 7,
		["烈焰震击"] = 7,
		["戈多克食人魔装"] = 8,
		["火焰增效"] = "加加恩·火锤",
		["驱散毒药"] = 8,
		["召唤黑手恐法师"] = "黑手召唤师",
		["丝绸卷"] = 9,
		["挥击"] = 11,
		["恐慌"] = "玛格曼达",
		["神圣之眼"] = 5,
		["震荡射击"] = 3,
		["祛病图腾"] = 7,
		["补充营养"] = 5,
		["英勇打击"] = 1,
		["疾病爆发"] = "虚弱的尸体",
		["狂暴之怒"] = 1,
		["脓疮之疹"] = "无名预言者",
		["烈焰尖刺"] = "亡首地卜师",
		["瑟银手榴弹"] = 9,
		["次级治疗波"] = 7,
		["地缚术"] = "地缚图腾 <吉恩丶石蹄>",
		["佯攻"] = 4,
		["嗜血术"] = "驯犬者洛克希",
		["俯冲"] = "盲眼",
		["喷液"] = "水浪幼崽 <海多斯博恩>",
		["符文布卷"] = 8,
		["突袭"] = 11,
		["重磅青铜炸弹"] = 4,
		["黑暗打击"] = "烈焰行者祭司",
		["熔岩喷吐"] = "玛格曼达",
		["麻痹之毒"] = "爬行者赫杜姆",
		["霜狼嗥叫者"] = 1,
		["召唤熔岩爪牙"] = "火焰之王",
		["支配"] = "大十字军战士达索汉",
		["侦测强效隐形"] = 9,
		["烟鬼的打火器"] = 8,
		["神恩回复"] = 5,
		["遗弃技能：冰霜"] = 8,
		["催眠术"] = "大检察官法尔班克斯",
		["结晶"] = "尖塔蜘蛛",
		["基尔罗格之眼"] = 9,
		["覆体之网"] = "地穴兽",
		["亚门纳尔之怒"] = "寒冰之王亚门纳尔",
		["召唤小软泥怪"] = "深色软泥怪",
		["破甲虚弱"] = "巨型血犬",
		["死亡缠绕"] = 9,
		["脊骨收割者"] = "独舞曼秀-水晶之牙",
		["反射"] = "玉脊蜥蜴",
		["安格弗的剑"] = 4,
		["强效怒气"] = 1,
		["嘲讽"] = 1,
		["宁静"] = 11,
		["闪耀徽章"] = 1,
		["分离"] = "洞穴雷霆蜥蜴",
		["钩网"] = "温格",
		["反击风暴"] = 1,
		["冲锋"] = 1,
		["火焰之盾效果 III"] = "血色招魂师",
		["天堂祝福"] = 1,
		["地精龙枪"] = "工匠吉兹洛克",
		["吞噬暗影"] = "复活的骷髅守卫",
		["免疫定身"] = 1,
		["冰冻新星"] = "莱斯·霜语",
		["棕色科多兽"] = 1,
		["疾病射击"] = "枯萎矛鬃野猪人",
		["元素掌握"] = 7,
		["黑曜石破碎"] = "黑曜石哨兵",
		["邪恶皮甲头环"] = 7,
		["石像形态"] = "零散的心情-黑曜石之锋",
		["猛虎之怒"] = 11,
		["次级智力"] = 5,
		["奴役恶魔"] = 9,
		["树形"] = "奥兹恩",
		["气定神闲"] = 8,
		["急速冷却"] = 8,
		["减速毒药"] = "荒野暗影行者",
		["奥术智慧"] = 8,
		["献祭陷阱"] = 3,
		["冰锥术"] = 8,
		["紫色迅猛龙"] = 8,
		["地精暗雷"] = "维格利",
		["腐蚀术"] = "奶茶双响炮",
		["风暴战斧"] = "子峰",
		["僵化"] = "苏利萨斯沙行者",
		["地穴甲虫"] = "地穴爬行者",
		["侏儒死亡射线"] = 8,
		["唤醒"] = 8,
		["召唤玩家"] = "比斯巨兽",
		["烟雾弹"] = "维利塔恩",
		["治疗结界"] = "石窟智者",
		["火焰冲击"] = 8,
		["爆炸陷阱效果"] = 3,
		["速效毒药"] = 4,
		["冰霜凝固"] = "加兹瑞拉",
		["治疗龙类"] = "黑手驭龙者",
		["感知"] = "联盟军医-范克瑞斯",
		["冰链术"] = "艾德雷斯鬼怪",
		["蛛网"] = "墓穴劫掠者",
		["干扰群居龙蛋"] = "群居孵化者",
		["附魔靴子 - 强效敏捷"] = 8,
		["遗弃技能：双手锤"] = 8,
		["食尸鬼瘟疫"] = "恶疫食尸鬼",
		["旋风斩"] = 1,
		["局部毒药"] = "剧毒飞蛇",
		["野葡萄药水"] = 11,
		["鬼魅灵魂"] = "鬼怪仆从",
		["枪械射击"] = 4,
		["消失"] = 4,
		["毒液喷吐"] = "黑暗粘液虫",
		["熔岩图腾"] = "熔岩图腾 <吉恩丶石蹄>",
		["吞噬之影"] = 8,
		["制造初级灵魂石"] = 9,
		["防御姿态"] = 1,
		["Summon Lava Burst C"] = "熔核鼠",
		["隐蔽"] = 8,
		["迅捷白色科多兽"] = 7,
		["原始狂怒"] = 11,
		["魂能之速"] = 4,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["解散野兽"] = 3,
		["盾击"] = 1,
		["安抚之吻"] = "布雷维恩 <Xmart>",
		["绞喉"] = 4,
		["活化炸弹"] = "迦顿男爵",
		["纠缠根须"] = "蟒藤",
		["炸弹"] = "维格利",
		["游荡瘟疫"] = 1,
		["扭曲宁静"] = "被诅咒的塞雷布拉斯",
		["翻滚扫击"] = "邪蝠",
		["救赎之魂"] = 5,
		["等待复活"] = 1,
		["召唤小鬼"] = 9,
		["弓射击"] = 1,
		["烈焰印记"] = "火印步兵",
		["侦测次级隐形"] = 9,
		["愈合"] = 11,
		["蝙蝠装束"] = 3,
		["嗜血"] = 1,
		["致盲"] = 4,
		["护甲"] = 4,
		["复仇"] = 1,
		["邪恶攻击"] = 4,
		["召唤魅魔"] = 9,
		["坑道蝎毒"] = "岩孔虫",
		["射击"] = "血色驯兽员",
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["重建"] = "厄炉工匠",
		["尖刺"] = "迟钝的钳嘴龟",
		["反魔法脉冲"] = "加尔",
		["元素领主的诅咒"] = "伊森迪奥斯",
		["潜行者护甲充能"] = 4,
		["奥法药剂"] = 8,
		["撕裂"] = 1,
		["洞察"] = 5,
		["幻象：黑龙"] = 7,
		["火焰破裂"] = "血斧招魂师",
		["召唤不散的怨灵"] = 8,
		["神圣震击"] = "剑忆红尘",
		["炮火"] = "炮弹",
		["神圣之盾"] = "可乐泡沫-火锤",
		["强击光环"] = 3,
		["召唤骷髅"] = "肆糖酥饼-范克瑞斯",
		["缩小"] = "格瑞姆洛克",
		["基尔图诺斯变形"] = "传令官基尔图诺斯",
		["熔岩喷溅"] = "焚化者古雷曼格",
		["朱莉叶的祝福"] = 4,
		["法力澎湃"] = 7,
		["迅捷灰色科多兽"] = 1,
		["暗影屏障"] = "通灵学院通灵师",
		["命令审判"] = "爸到",
		["唤醒地灵宝库守卫"] = "阿扎达斯",
		["召唤水中护卫"] = "暮光水占师",
		["精神错乱"] = 1,
		["召唤恐惧战马"] = 9,
		["使用节日酒杯"] = 1,
		["撒网器"] = 4,
		["血色复活"] = "大检察官怀特迈恩",
		["Falling"] = "环境伤害 (高处坠落)",
		["拦截"] = 1,
		["击碎护甲"] = "扭木摧毁者",
		["传送"] = "管理者埃克索图斯",
		["法力之泉图腾"] = 7,
		["刺骨"] = 4,
		["冰霜震击"] = 7,
		["自然之赐"] = 11,
		["树皮术"] = 11,
		["自然抗性"] = 7,
		["奥术之力"] = "红衣法术师",
		["防护火焰结界"] = 8,
		["野猪之皮"] = 5,
		["解除次级诅咒"] = 8,
		["骷髅装束"] = 7,
		["撒网"] = "图特卡什",
		["腐蚀酸液"] = "博学者普克尔特",
		["盾牌冲锋"] = "黑手老兵",
		["陷地图腾"] = "安图苏尔",
		["火舌图腾"] = 7,
		["虚弱之触"] = 5,
		["食尸"] = 4,
		["显现灵魂"] = 5,
		["生命分流"] = 9,
		["牺牲祝福"] = "有好果汁吃",
		["诅咒增幅"] = 9,
		["星界传送"] = 7,
		["复活术"] = 5,
		["精神鞭笞"] = 5,
		["祸害之毒"] = "爬行者赫杜姆",
		["穿刺射击"] = "暗炉狙击手",
		["夜龙之息"] = 9,
		["脆弱"] = "祖罗尔",
		["幼虫粘液"] = "邪恶幼虫",
		["禁闭"] = "黑手监禁者",
		["致命武器"] = 4,
		["洛恩塔姆之魂"] = "普希林",
		["落雷之云"] = "奥术洪流",
		["火锥术"] = "烈焰守卫",
		["迅捷治愈"] = 11,
		["追踪亡灵"] = 3,
		["诱惑"] = "胡库的魅魔 <胡库>",
		["瓦罗什的变形"] = "赎罪的瓦罗什",
		["奥术飞弹"] = "血斧召唤师",
		["无畏冲锋"] = 4,
		["绿色迅猛龙"] = 8,
		["法力之泉"] = "法力之泉图腾 <吉恩丶石蹄>",
		["酸息术"] = "哈扎斯",
		["大地震颤"] = "石头管理者",
		["毒云术"] = 4,
		["追踪野兽"] = 3,
		["衰减魔法"] = "沙斯拉尔",
		["沙斯拉尔之门"] = "沙斯拉尔",
		["神圣新星"] = 5,
		["治疗药膏"] = "飒飒-毁灭之刃",
		["召唤法力脉冲"] = "畸形残渣",
		["遗弃技能"] = "痛苦的文官",
		["天选印记效果"] = 1,
		["召唤地狱猎犬"] = 9,
		["沙尘风暴"] = "古代的石头看守者",
		["伺机待发"] = 4,
		["困兽之爪"] = "噬棘食尸鬼",
		["大地之力图腾"] = 7,
		["毒液箭"] = "毒劣魔",
		["驱毒术"] = 11,
		["紫色骷髅战马"] = 8,
		["制造维格利的酒桶"] = "维格利",
		["治疗之泉图腾"] = 7,
		["风墙"] = 7,
		["脚踢 - 沉默"] = 4,
		["驱散魔法"] = 5,
		["颅骨爆裂"] = "战斗傀儡",
		["爪击"] = "蛋黄",
		["烈焰打击"] = "石窟地占师",
		["堕落自然之力"] = "被诅咒的塞雷布拉斯",
		["束缚亡灵"] = 5,
		["暗影强化"] = 9,
		["漂浮术"] = 5,
		["激怒"] = 11,
		["上古绝望"] = "上古熔火恶犬",
		["基赫纳斯的诅咒"] = "基赫纳斯",
		["黑色作战科多兽"] = 8,
		["正义之手"] = "朕总想害刁民",
		["痛苦诅咒"] = 8,
		["解除诅咒"] = 11,
		["耐力提高"] = 4,
		["骨甲术"] = "亡首通灵师",
		["护甲 +24"] = 5,
		["召唤哈卡"] = "哈卡的阴影",
		["清算圣印"] = "弗诺斯·达克维尔",
		["毒性喷溅"] = "变异剧毒风蛇",
		["熟化毛皮"] = 1,
		["猎豹形态"] = 11,
		["庇护"] = 1,
		["瓦罗什之痒"] = "瓦罗什",
		["防护元素图腾"] = "燃棘巫医",
		["破釜沉舟"] = 1,
		["自然抗性图腾"] = 7,
		["血液分流"] = "影牙暴食者",
		["次级隐形术"] = "纳兹拉恩 <Paganini>",
		["迅捷蓝色迅猛龙"] = 3,
		["风之优雅"] = 7,
		["龙尾扫击"] = "奥妮克希亚",
		["呀啊啊啊啊"] = 1,
		["烈焰"] = "达格兰·索瑞森大帝",
		["割碎"] = "熔火怒犬",
		["意志之力"] = 1,
		["麻痹毒药 III"] = 4,
		["鞭笞"] = "哈卡的化身",
		["枯萎之触"] = "枯萎野猪人守卫",
		["圆弧斩"] = "艾隆纳亚",
		["冰霜新星"] = 8,
		["腐蚀毒药"] = 4,
		["猛禽一击"] = 3,
		["腐蚀酸液吐息"] = "盖斯",
		["减速术"] = "血色魔术师",
		["毒害之灾"] = "诺克赛恩幼体",
		["次级治疗术"] = 5,
		["防护暗影"] = 5,
		["灵魂之火"] = 9,
		["扭曲"] = "厄炉工匠",
		["法力之潮"] = "法力之潮图腾 <基本元素>",
		["背刺"] = 4,
		["火焰突变"] = "比斯巨兽",
		["先祖之魂"] = 7,
		["深度睡眠"] = "大检察官怀特迈恩",
		["加速术"] = 11,
		["火焰新星图腾"] = 7,
		["燃灵术"] = "弗莱拉斯大使",
		["唤醒地灵守护者"] = "阿扎达斯",
		["祛病术"] = 7,
		["虚弱妖术"] = 5,
		["次级吸收"] = 5,
		["尖啸"] = "猫头鹰 <繁花血景丶>",
		["追踪元素生物"] = 3,
		["制造强效治疗石"] = 9,
		["诺格弗格药剂"] = 5,
		["消毒术"] = 7,
		["无力诅咒"] = "荒野欺诈者",
		["硬化外皮"] = "僵化的树人",
		["照明弹"] = 3,
		["蓝色骸骨军马"] = 4,
		["惩罚光环"] = "血色十字军指挥官莫格莱尼",
		["迅捷森林狼"] = 1,
		["白骨熔化"] = "红衣铸锤师",
		["水"] = "巨型喷泉 <海多斯博恩>",
		["毒害之云"] = "毒性软泥怪",
		["召唤祖尔法拉克僵尸"] = "祖尔法拉克僵尸",
		["制造魔法翡翠"] = 8,
		["风花果"] = 4,
		["无荣誉目标"] = 1,
		["冷血"] = 4,
		["棕狼"] = 4,
		["M73破片手榴弹"] = 9,
		["冰甲术"] = 8,
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = 1,
		["制造特效治疗石"] = 9,
		["火焰之盾 III"] = "血色招魂师",
		["召唤追踪犬"] = 4,
		["制造次级灵魂石"] = 9,
		["致伤毒药"] = 4,
		["索瑞森之手"] = "达格兰·索瑞森大帝",
		["强化意志"] = "尖石军阀",
		["黑暗治疗"] = "通灵学院侍僧",
		["吸血毒药"] = "盲光泥居者",
		["毁灭"] = 11,
		["绝望祷言"] = "有点迟钝",
	},
	["encounter_spell_pool"] = {
		{
			1084, -- [1]
			"奥妮克希亚", -- [2]
		}, -- [1]
		[0] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["叉状闪电"] = {
			0, -- [1]
			"尖石秘法师", -- [2]
		},
		["法术反制"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["回春术"] = {
			0, -- [1]
			"尖石秘法师", -- [2]
		},
		["重伤"] = {
			663, -- [1]
			"烈焰行者护卫", -- [2]
		},
		["邪恶攻击"] = {
			0, -- [1]
			"云德", -- [2]
		},
		["伊莫塔尔传送门"] = {
			0, -- [1]
			"伊莫塔尔", -- [2]
		},
		["恢复"] = {
			0, -- [1]
			5, -- [2]
		},
		["昏迷炸弹"] = {
			0, -- [1]
			"军需官兹格雷斯", -- [2]
		},
		["真言术：韧"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["荆棘光环"] = {
			0, -- [1]
			"变异守护者", -- [2]
		},
		["召唤红衣火枪手"] = {
			0, -- [1]
			"炮手威利", -- [2]
		},
		["寒冰箭"] = {
			0, -- [1]
			"通灵学院专家", -- [2]
		},
		["荆棘术"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["强效治疗术"] = {
			663, -- [1]
			5, -- [2]
		},
		["召唤传送门"] = {
			0, -- [1]
			"阿鲁高", -- [2]
		},
		["激流"] = {
			0, -- [1]
			"海多斯博恩", -- [2]
		},
		["Summon Lava Burst A"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["制裁之锤"] = {
			0, -- [1]
			"指挥官斯普林瓦尔", -- [2]
		},
		["眩晕"] = {
			0, -- [1]
			"奥兹恩的爪牙", -- [2]
		},
		["真言术：盾"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["嘲讽"] = {
			663, -- [1]
			1, -- [2]
		},
		["快速治疗"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["雷霆一击"] = {
			0, -- [1]
			"皮萨斯", -- [2]
		},
		["嗜血"] = {
			663, -- [1]
			1, -- [2]
		},
		["火焰爆发"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["召唤错觉狼影"] = {
			0, -- [1]
			"暗牙恐狼", -- [2]
		},
		["火息术"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["暗影迷雾"] = {
			0, -- [1]
			"阿雷克斯·巴罗夫", -- [2]
		},
		["治疗链"] = {
			663, -- [1]
			7, -- [2]
		},
		["牺牲"] = {
			671, -- [1]
			"克拉斯纳尔", -- [2]
		},
		["末日降临"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["法力之泉"] = {
			0, -- [1]
			"法力之泉图腾 IV <吉恩丶石蹄>", -- [2]
		},
		["笨拙术"] = {
			0, -- [1]
			"影牙魔魂狼人", -- [2]
		},
		["冰链术"] = {
			0, -- [1]
			"艾德雷斯鬼怪", -- [2]
		},
		["投掷"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["女妖诅咒"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["召唤玩家"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["黑暗回复"] = {
			0, -- [1]
			"影牙狼人卫兵", -- [2]
		},
		["冰冻术"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["撕咬"] = {
			663, -- [1]
			"意大利面 <Sekio>", -- [2]
		},
		["补充法力"] = {
			663, -- [1]
			8, -- [2]
		},
		["连发寒冰箭"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"阿奎尼斯男爵", -- [2]
		},
		["点燃法力"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["火焰之雨"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["献祭陷阱"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["奥术冲击"] = {
			0, -- [1]
			"托塞德林王子", -- [2]
		},
		["寒冰之墓"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["神圣打击"] = {
			0, -- [1]
			"铁怒队长", -- [2]
		},
		["召唤破碎的死尸"] = {
			0, -- [1]
			"被毁坏的死尸", -- [2]
		},
		["熔岩喷吐"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["地狱火"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["击昏"] = {
			0, -- [1]
			"吞咽者拉姆斯登", -- [2]
		},
		["火焰之盾"] = {
			0, -- [1]
			"火焰卫士", -- [2]
		},
		["统御意志"] = {
			663, -- [1]
			"烈焰行者护卫", -- [2]
		},
		["燃灵术"] = {
			0, -- [1]
			"弗莱拉斯大使", -- [2]
		},
		["挫志怒吼"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["霜甲术"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["痛击"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["狂暴怒气"] = {
			0, -- [1]
			"阿库麦尔", -- [2]
		},
		["感染撕咬"] = {
			0, -- [1]
			"伊莫塔尔", -- [2]
		},
		["堕落自然之力"] = {
			0, -- [1]
			"被诅咒的塞雷布拉斯", -- [2]
		},
		["熔岩镣铐"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["熔岩爆裂"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["狂怒"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["吸取生命"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["虚空箭"] = {
			0, -- [1]
			"蕾瑟塔蒂丝", -- [2]
		},
		["暗影箭雨"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["烈焰火炮"] = {
			0, -- [1]
			"怒锤傀儡", -- [2]
		},
		["拉格纳罗斯之手"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["破胆咆哮"] = {
			0, -- [1]
			"乌洛克", -- [2]
		},
		["圆弧斩"] = {
			0, -- [1]
			"复活的构造体", -- [2]
		},
		["死亡缠绕"] = {
			663, -- [1]
			9, -- [2]
		},
		["拉格纳罗斯之怒"] = {
			0, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["打击"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["闪避"] = {
			0, -- [1]
			"腐烂巡影者", -- [2]
		},
		["巨化术"] = {
			0, -- [1]
			"尖石首席法师", -- [2]
		},
		["狂暴怒火"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["烈焰化身"] = {
			0, -- [1]
			"达格兰·索瑞森大帝", -- [2]
		},
		["恢复法力"] = {
			663, -- [1]
			3, -- [2]
		},
		["燃烧"] = {
			664, -- [1]
			"熔岩炸弹", -- [2]
		},
		["低沉咆哮"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["芬古斯的狂暴"] = {
			0, -- [1]
			"卫兵芬古斯", -- [2]
		},
		["飞扑"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["火球术"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["盾牌格挡"] = {
			663, -- [1]
			1, -- [2]
		},
		["烈焰震击"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["狂暴冲锋"] = {
			0, -- [1]
			"戈多克大王", -- [2]
		},
		["震荡射击"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["防护火焰结界"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["原始狂怒"] = {
			0, -- [1]
			11, -- [2]
		},
		["脚踢"] = {
			0, -- [1]
			"铁怒步兵", -- [2]
		},
		["Summon Lava Burst G"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["恐慌"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["毒蛇钉刺"] = {
			0, -- [1]
			3, -- [2]
		},
		["爪击"] = {
			663, -- [1]
			11, -- [2]
		},
		["十字军打击"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["暗影箭"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["召唤虚空行者"] = {
			0, -- [1]
			"杜姆雷尔", -- [2]
		},
		["召唤幻象"] = {
			0, -- [1]
			"詹迪斯·巴罗夫", -- [2]
		},
		["麻痹之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["拳击"] = {
			0, -- [1]
			"驯犬者格雷布玛尔", -- [2]
		},
		["瘟疫之云"] = {
			0, -- [1]
			"圣甲虫", -- [2]
		},
		["暗影之门"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["黑暗主宰诅咒"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["结晶"] = {
			0, -- [1]
			"尖塔蜘蛛", -- [2]
		},
		["恶魔皮肤"] = {
			0, -- [1]
			"沙怒暗影法师", -- [2]
		},
		["Summon Lava Burst E"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["覆体之网"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["致死顺劈"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["挥击"] = {
			0, -- [1]
			11, -- [2]
		},
		["黑色腐烂"] = {
			0, -- [1]
			"瘟疫鼠", -- [2]
		},
		["放逐术"] = {
			0, -- [1]
			"戈多克术士", -- [2]
		},
		["钩网"] = {
			0, -- [1]
			"军需官兹格雷斯", -- [2]
		},
		["狂暴姿态"] = {
			663, -- [1]
			1, -- [2]
		},
		["精神鞭笞"] = {
			0, -- [1]
			"通灵学院侍僧", -- [2]
		},
		["吞噬暗影"] = {
			0, -- [1]
			"复活的骷髅守卫", -- [2]
		},
		["冰冻新星"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["破甲攻击"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["死尸虫"] = {
			0, -- [1]
			"被撕裂的死尸", -- [2]
		},
		["往日的尖啸"] = {
			0, -- [1]
			"哀嚎的卫兵", -- [2]
		},
		["变形术"] = {
			0, -- [1]
			"尖石首席法师", -- [2]
		},
		["抵抗火焰"] = {
			0, -- [1]
			"裂盾缚法师", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["奥术箭"] = {
			0, -- [1]
			"尖石首席法师", -- [2]
		},
		["破甲顺劈"] = {
			0, -- [1]
			"拉文尼亚", -- [2]
		},
		["烟雾弹"] = {
			0, -- [1]
			"维利塔恩", -- [2]
		},
		["圣光击"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["闪电箭"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["特效治疗石"] = {
			663, -- [1]
			1, -- [2]
		},
		["腐蚀术"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["刺破"] = {
			0, -- [1]
			"乌洛克惩戒者", -- [2]
		},
		["寒冬"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["地穴甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["恶毒撕裂"] = {
			0, -- [1]
			"剜眼者", -- [2]
		},
		["黑暗瘟疫"] = {
			0, -- [1]
			"复生的尸体", -- [2]
		},
		["治疗结界"] = {
			0, -- [1]
			"沙怒巫医", -- [2]
		},
		["元素领主的诅咒"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["野性冲锋效果"] = {
			0, -- [1]
			11, -- [2]
		},
		["火焰冲击"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["火焰之盾效果 III"] = {
			0, -- [1]
			"血色巫师", -- [2]
		},
		["毒药"] = {
			0, -- [1]
			"无毒飞蛇", -- [2]
		},
		["治疗波"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["上钩拳"] = {
			0, -- [1]
			"怒锤傀儡", -- [2]
		},
		["复活亡灵甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["反魔法盾"] = {
			0, -- [1]
			"剜眼者", -- [2]
		},
		["瞄准射击"] = {
			0, -- [1]
			3, -- [2]
		},
		["掷斧"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["脓疮撕咬"] = {
			0, -- [1]
			"瘟疫虫", -- [2]
		},
		["火焰之盾 III"] = {
			0, -- [1]
			"血色巫师", -- [2]
		},
		["食尸鬼瘟疫"] = {
			0, -- [1]
			"恶疫食尸鬼", -- [2]
		},
		["旋风斩"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["陷地图腾"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["沉默"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["鬼魅灵魂"] = {
			0, -- [1]
			"鬼怪仆从", -- [2]
		},
		["伊莫塔尔之眼"] = {
			0, -- [1]
			"伊莫塔尔", -- [2]
		},
		["喝下治疗药水"] = {
			0, -- [1]
			"军需官兹格雷斯", -- [2]
		},
		["拉格纳罗斯之拳"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["裂筋"] = {
			0, -- [1]
			"戈多克驯狼", -- [2]
		},
		["恐惧术"] = {
			0, -- [1]
			"通灵学院新学徒", -- [2]
		},
		["拍翼"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["防御姿态"] = {
			663, -- [1]
			1, -- [2]
		},
		["Summon Lava Burst C"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["尖牙撕咬"] = {
			663, -- [1]
			"熔火恶犬", -- [2]
		},
		["闪电之盾"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["地震术"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["魔法吸收"] = {
			663, -- [1]
			8, -- [2]
		},
		["虚弱诅咒"] = {
			0, -- [1]
			"阿努希尔", -- [2]
		},
		["魔爆术"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["无情打击效果"] = {
			663, -- [1]
			4, -- [2]
		},
		["盾击"] = {
			0, -- [1]
			"卫兵斯里基克", -- [2]
		},
		["圣盾术"] = {
			0, -- [1]
			"指挥官斯普林瓦尔", -- [2]
		},
		["被遗忘者的意志"] = {
			663, -- [1]
			1, -- [2]
		},
		["活化炸弹"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["阿鲁高的礼物"] = {
			0, -- [1]
			"阿鲁高之子", -- [2]
		},
		["炸弹"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["缠绕之藤"] = {
			0, -- [1]
			"特迪斯·扭木", -- [2]
		},
		["击退"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["翻滚扫击"] = {
			0, -- [1]
			"邪蝠", -- [2]
		},
		["烈焰之团"] = {
			0, -- [1]
			"铁手卫士", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"铁怒预备兵", -- [2]
		},
		["割碎"] = {
			670, -- [1]
			"熔火怒犬", -- [2]
		},
		["召唤雷德·黑手"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["烈焰印记"] = {
			0, -- [1]
			"火印步兵", -- [2]
		},
		["驱散魔法"] = {
			0, -- [1]
			"艾德雷斯妖灵", -- [2]
		},
		["Burning Felguard Spawn"] = {
			0, -- [1]
			"燃烧地狱卫士 <裂盾术士>", -- [2]
		},
		["大地震颤"] = {
			0, -- [1]
			"格里兹尔", -- [2]
		},
		["熔岩喷射图腾"] = {
			0, -- [1]
			"沙怒巫医", -- [2]
		},
		["奥术气泡"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["蛆虫粘液"] = {
			0, -- [1]
			"瘟疫蛆", -- [2]
		},
		["妖术"] = {
			0, -- [1]
			"暗影猎手沃什加斯", -- [2]
		},
		["灵魂撕裂"] = {
			0, -- [1]
			"艾德雷斯鬼巫", -- [2]
		},
		["盾牌猛击"] = {
			663, -- [1]
			1, -- [2]
		},
		["毒云术"] = {
			0, -- [1]
			"阿库麦尔", -- [2]
		},
		["暗言术：痛"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["吸血一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["群体打击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["魔甲术"] = {
			0, -- [1]
			"阿努希尔", -- [2]
		},
		["Summon Lava Burst F"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["反魔法脉冲"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["横扫攻击"] = {
			0, -- [1]
			"复活的构造体", -- [2]
		},
		["腐蚀酸液"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["恐怖低吼"] = {
			0, -- [1]
			"血犬", -- [2]
		},
		["撕裂"] = {
			663, -- [1]
			1, -- [2]
		},
		["冰冻"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["攻击"] = {
			0, -- [1]
			"灼烧图腾 <控火师罗格雷恩>", -- [2]
		},
		["烈焰"] = {
			0, -- [1]
			"达格兰·索瑞森大帝", -- [2]
		},
		["吸血毒药"] = {
			0, -- [1]
			"盲光泥居者", -- [2]
		},
		["冲击波"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["神圣力量"] = {
			663, -- [1]
			4, -- [2]
		},
		["狂怒之嚎"] = {
			663, -- [1]
			"意大利面 <Sekio>", -- [2]
		},
		["鲁西弗隆的诅咒"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["疾病之云"] = {
			0, -- [1]
			"缝补憎恶", -- [2]
		},
		["树形"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["基尔图诺斯变形"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["熔岩喷溅"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["黑暗符文"] = {
			663, -- [1]
			7, -- [2]
		},
		["黑暗打击"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["多重射击"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["暗影屏障"] = {
			0, -- [1]
			"通灵学院通灵师", -- [2]
		},
		["血之诅咒"] = {
			0, -- [1]
			"维雷克", -- [2]
		},
		["热疫"] = {
			0, -- [1]
			"殉教者塞卡", -- [2]
		},
		["传送到玩家"] = {
			1084, -- [1]
			"奥妮克希亚雏龙", -- [2]
		},
		["割裂"] = {
			0, -- [1]
			"黑须的亲信", -- [2]
		},
		["烈焰之矛"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["摩尔达的勇气"] = {
			0, -- [1]
			"卫兵摩尔达", -- [2]
		},
		["蛛后的乳汁"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["血色复活"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["灵魂分流"] = {
			0, -- [1]
			"图萨丁亡灵法师", -- [2]
		},
		["剧烈痛楚"] = {
			0, -- [1]
			"瑟雷姆·刺蹄", -- [2]
		},
		["烈焰打击"] = {
			0, -- [1]
			"匹姆吉布", -- [2]
		},
		["传送"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["血液分流"] = {
			0, -- [1]
			"影牙暴食者", -- [2]
		},
		["闪现术"] = {
			0, -- [1]
			"维利塔恩", -- [2]
		},
		["多彩混乱"] = {
			0, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["投网"] = {
			0, -- [1]
			"格里哈斯特", -- [2]
		},
		["灵感"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["槌击"] = {
			0, -- [1]
			"费拉", -- [2]
		},
		["刺骨"] = {
			0, -- [1]
			"云德", -- [2]
		},
		["元素火焰"] = {
			0, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["祖穆拉恩结界"] = {
			0, -- [1]
			"巫医祖穆拉恩", -- [2]
		},
		["破碎一击"] = {
			0, -- [1]
			"戈多克蛮兵", -- [2]
		},
		["精灵之火（野性）"] = {
			0, -- [1]
			11, -- [2]
		},
		["Summon Lava Burst D"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["横扫猛击"] = {
			0, -- [1]
			"维姆萨拉克", -- [2]
		},
		["减速术"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["杀死乌洛克的爪牙"] = {
			0, -- [1]
			"Challenge to Urok Trap", -- [2]
		},
		["强化意志"] = {
			0, -- [1]
			"尖石军阀", -- [2]
		},
		["剧痛鞭笞"] = {
			0, -- [1]
			"抽笞者", -- [2]
		},
		["沙斯拉尔的诅咒"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["!Autoshot"] = {
			0, -- [1]
			5, -- [2]
		},
		["践踏"] = {
			0, -- [1]
			"拉文尼亚", -- [2]
		},
		["裂盾传送门"] = {
			0, -- [1]
			"裂盾术士", -- [2]
		},
		["熔岩吐息"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["伤害反射护盾"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["鲁莽"] = {
			0, -- [1]
			"格鲁雷尔", -- [2]
		},
		["心灵震爆"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["祸害之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"铁怒预备兵", -- [2]
		},
		["治疗之触"] = {
			0, -- [1]
			"尖牙德鲁伊", -- [2]
		},
		["冲锋"] = {
			0, -- [1]
			"费拉", -- [2]
		},
		["血性狂暴"] = {
			663, -- [1]
			1, -- [2]
		},
		["召唤警戒座狼"] = {
			0, -- [1]
			"影牙狼人卫兵", -- [2]
		},
		["纠缠根须"] = {
			0, -- [1]
			"埃隆巴克保护者", -- [2]
		},
		["心灵尖啸"] = {
			0, -- [1]
			"审讯官格斯塔恩", -- [2]
		},
		["暗影震击"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["自杀"] = {
			0, -- [1]
			"阿莎利水晶", -- [2]
		},
		["血红之怒"] = {
			0, -- [1]
			"艾德雷斯怨魂", -- [2]
		},
		["燃烧之风"] = {
			0, -- [1]
			"档案管理员加尔福特", -- [2]
		},
		["炮火"] = {
			0, -- [1]
			"炮弹", -- [2]
		},
		["奥术飞弹"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["岩浆喷溅"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["火焰新星"] = {
			0, -- [1]
			"饥饿者塔拉加曼", -- [2]
		},
		["Summon Lava Burst B"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["凿击"] = {
			0, -- [1]
			"雷布里·斯库比格特", -- [2]
		},
		["暴风雪"] = {
			0, -- [1]
			8, -- [2]
		},
		["屠夫吸取"] = {
			0, -- [1]
			"屠夫拉佐克劳", -- [2]
		},
		["摇摆意志"] = {
			0, -- [1]
			"灰色座狼", -- [2]
		},
		["刺骨暗影"] = {
			0, -- [1]
			"图萨丁暗影法师", -- [2]
		},
		["衰减魔法"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["沙斯拉尔之门"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["战斗姿态"] = {
			0, -- [1]
			"死亡之誓", -- [2]
		},
		["Summon Lava Burst H"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["连珠火球"] = {
			0, -- [1]
			"火焰驱逐者", -- [2]
		},
		["灵魂虹吸"] = {
			0, -- [1]
			"永醒的艾希尔", -- [2]
		},
		["水"] = {
			0, -- [1]
			"巨型喷泉 <海多斯博恩>", -- [2]
		},
		["圣疗术"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["治疗药水"] = {
			663, -- [1]
			1, -- [2]
		},
		["愤怒"] = {
			0, -- [1]
			"被诅咒的塞雷布拉斯", -- [2]
		},
		["强化格挡"] = {
			0, -- [1]
			"血色防御者", -- [2]
		},
		["灵魂消耗"] = {
			0, -- [1]
			"雷希戈尔", -- [2]
		},
		["魔法反射"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["纠缠"] = {
			0, -- [1]
			"特迪斯·扭木", -- [2]
		},
		["暗灰狼形态"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["毒害之灾"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["困兽之爪"] = {
			0, -- [1]
			"悲惨的提米", -- [2]
		},
		["召唤尖塔小蜘蛛"] = {
			0, -- [1]
			"尖塔蜘蛛", -- [2]
		},
		["凶猛撕咬"] = {
			663, -- [1]
			11, -- [2]
		},
		["猛踢"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["邪恶光环"] = {
			0, -- [1]
			"阿雷克斯·巴罗夫", -- [2]
		},
		["致死打击"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["催眠术"] = {
			0, -- [1]
			"安娜科德拉", -- [2]
		},
		["撕扯"] = {
			663, -- [1]
			11, -- [2]
		},
		["火焰风暴"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["炎爆术"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["颅骨爆裂"] = {
			0, -- [1]
			"战斗傀儡", -- [2]
		},
		["末日决战"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["恢复能量"] = {
			663, -- [1]
			4, -- [2]
		},
		["基赫纳斯的诅咒"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["震击"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["正义之手"] = {
			663, -- [1]
			11, -- [2]
		},
		["痛苦诅咒"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["清算圣印"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["混乱集中"] = {
			0, -- [1]
			"荒野魔仆", -- [2]
		},
		["骨甲术"] = {
			0, -- [1]
			"通灵学院神秘学者", -- [2]
		},
		["召唤贝尔加的产物"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["熔岩冲击"] = {
			0, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["减速毒药"] = {
			0, -- [1]
			"荒野暗影行者", -- [2]
		},
		["毒性喷溅"] = {
			0, -- [1]
			"变异剧毒风蛇", -- [2]
		},
		["Summon Lava Burst I"] = {
			0, -- [1]
			"熔核鼠", -- [2]
		},
		["全力一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["嚎叫之怒"] = {
			0, -- [1]
			"盲眼守卫奥杜", -- [2]
		},
		["蛛网爆炸"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["暗影之盾"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["恶毒之咬"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["圣光术"] = {
			0, -- [1]
			"指挥官斯普林瓦尔", -- [2]
		},
		["法力燃烧"] = {
			0, -- [1]
			"通灵学院侍僧", -- [2]
		},
		["遗弃技能"] = {
			0, -- [1]
			"痛苦的文官", -- [2]
		},
		["毒蛇形态"] = {
			0, -- [1]
			"尖牙德鲁伊", -- [2]
		},
		["毒液喷吐"] = {
			0, -- [1]
			"泼毒者", -- [2]
		},
		["撕碎"] = {
			663, -- [1]
			11, -- [2]
		},
		["反手一击"] = {
			0, -- [1]
			"瑟尔林·卡斯迪诺夫教授", -- [2]
		},
		["自爆"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["醉酒怒气"] = {
			0, -- [1]
			"霍尔雷·黑须", -- [2]
		},
		["斯里基克的机智"] = {
			0, -- [1]
			"卫兵斯里基克", -- [2]
		},
		["催眠曲"] = {
			0, -- [1]
			"弗雷斯特恩", -- [2]
		},
		["缴械"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["虔诚光环"] = {
			0, -- [1]
			"铁怒队长", -- [2]
		},
		["盾牌冲锋"] = {
			0, -- [1]
			"卫兵斯里基克", -- [2]
		},
		["刺穿护甲"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["暗影形态"] = {
			0, -- [1]
			"卡雷迪斯镇长", -- [2]
		},
		["残废术"] = {
			0, -- [1]
			"末日守卫", -- [2]
		},
		["腐蚀酸液吐息"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["毒性唾液"] = {
			0, -- [1]
			"吞噬者芬鲁斯", -- [2]
		},
		["女妖尖叫"] = {
			0, -- [1]
			"艾德雷斯鬼巫", -- [2]
		},
		["野性暴怒"] = {
			0, -- [1]
			"影牙暴怒者", -- [2]
		},
		["熔岩之盾"] = {
			0, -- [1]
			"烈焰之子", -- [2]
		},
		["重建"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["扭曲"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["吐息"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["献祭"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["弱化"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
		["淹没"] = {
			0, -- [1]
			"海多斯博恩", -- [2]
		},
		["深度睡眠"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["女妖哀嚎"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["破甲虚弱"] = {
			0, -- [1]
			"觅血者", -- [2]
		},
		["冰锥术"] = {
			0, -- [1]
			"艾德雷斯鬼怪", -- [2]
		},
		["语言诅咒"] = {
			0, -- [1]
			"戈多克术士", -- [2]
		},
		["快速传染"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["缩小"] = {
			0, -- [1]
			"复活的守护者", -- [2]
		},
		["法力之潮"] = {
			667, -- [1]
			"法力之潮图腾 III <吉恩丶石蹄>", -- [2]
		},
		["灼烧图腾"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["冰霜射击"] = {
			0, -- [1]
			"泽雷利斯", -- [2]
		},
		["乱射"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["狂乱"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["恶性毒药"] = {
			0, -- [1]
			"死亡鞭笞者", -- [2]
		},
		["星辰碎片"] = {
			0, -- [1]
			"艾德雷斯巫师", -- [2]
		},
		["凝视"] = {
			0, -- [1]
			"复活的畸形骷髅", -- [2]
		},
		["龙尾扫击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["毒液箭"] = {
			0, -- [1]
			"毒劣魔", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"尖石首席法师", -- [2]
		},
		["战争践踏"] = {
			0, -- [1]
			"血骨傀儡", -- [2]
		},
		["巨型喷泉"] = {
			0, -- [1]
			"海多斯博恩", -- [2]
		},
		["治疗术"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["冰霜震击"] = {
			0, -- [1]
			"复仇的幻影", -- [2]
		},
		["考布莱恩毒蛇形态"] = {
			0, -- [1]
			"考布莱恩", -- [2]
		},
		["心灵之火"] = {
			0, -- [1]
			"血色牧师", -- [2]
		},
		["Enrage Trigger"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["龙翼攻击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["疾病爆发"] = {
			0, -- [1]
			"虚弱的尸体", -- [2]
		},
		["旋风斩效果"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["召唤水浪幼崽"] = {
			0, -- [1]
			"海多斯博恩", -- [2]
		},
		["喷液"] = {
			0, -- [1]
			"水浪幼崽 <海多斯博恩>", -- [2]
		},
		["吸血术"] = {
			0, -- [1]
			"沙怒饮血者", -- [2]
		},
		["破胆怒吼"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["爆发"] = {
			1084, -- [1]
			"熔岩裂缝", -- [2]
		},
		["包围之网"] = {
			0, -- [1]
			"地穴爬行者", -- [2]
		},
		["断筋"] = {
			0, -- [1]
			"铁怒预备兵", -- [2]
		},
		["炽热之地"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["顺劈斩"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["!Melee"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["裂颅"] = {
			0, -- [1]
			"食尸抢夺者", -- [2]
		},
		["黑暗治疗"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["惩罚光环"] = {
			0, -- [1]
			"血色巫师", -- [2]
		},
		["火焰的召唤"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["野性回复"] = {
			0, -- [1]
			"奥兹恩", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
	},
	["__profiles"] = {
		["周伯通丫-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -325.999389648438,
							["x"] = 766.0009765625,
							["w"] = 310.000061035156,
							["h"] = 157.999969482422,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 0,
								["textFace"] = "Accidental Presidency",
								["timeType"] = 1,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["micro_displays_side"] = 2,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = 135.000579833984,
						["x"] = -38.9990234375,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_all_roles_after_wipe"] = false,
					["bars_grow_direction"] = 1,
					["micro_displays_locked"] = true,
					["ignore_mass_showhide"] = false,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["auto_current"] = true,
					["version"] = 3,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["texture_custom_file"] = "Interface\\",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["textL_enable_custom_text"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = true,
						["texture"] = "BantoBar",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = true,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["font_size"] = 16,
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -325.999389648438,
							["x"] = 766.0009765625,
							["w"] = 310.000061035156,
							["h"] = 157.999969482422,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_tank_in_combat"] = false,
					["switch_healer_in_combat"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["desaturated_menu"] = false,
					["show_sidebars"] = false,
					["bars_inverted"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["Minuitsun-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["time_type_original"] = 2,
			["default_bg_alpha"] = 0.5,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["time_type"] = 2,
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["pvp_as_group"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["overall_flag"] = 16,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["broadcaster_enabled"] = false,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["animation_speed_triggertravel"] = 5,
			["trash_auto_remove"] = true,
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -431.00065612793,
							["x"] = 805.001586914063,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["timeType"] = 1,
								["textXMod"] = 6,
								["textAlign"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["texture_custom_file"] = "Interface\\",
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
					},
					["bg_b"] = 0.0941176470588235,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["micro_displays_side"] = 2,
					["hide_in_combat_alpha"] = 0,
					["switch_damager"] = false,
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 30.0002059936523,
						["x"] = 0,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["ignore_mass_showhide"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["switch_all_roles_after_wipe"] = false,
					["switch_tank_in_combat"] = false,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["clickthrough_rows"] = false,
					["auto_current"] = true,
					["version"] = 3,
					["backdrop_texture"] = "Details Ground",
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -431.00065612793,
							["x"] = 805.001586914063,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["skin_custom"] = "",
					["bars_sort_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["clickthrough_window"] = false,
					["__was_opened"] = true,
					["show_statusbar"] = false,
				}, -- [1]
			},
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
		["Poetic-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0.0001220703125,
							["x"] = -0.0001220703125,
							["w"] = 309.999908447266,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textAlign"] = 0,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textFace"] = "Accidental Presidency",
								["timeType"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bars_inverted"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["desaturated_menu"] = false,
					["hide_in_combat_alpha"] = 0,
					["switch_tank"] = false,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = 7.629394531250e-05,
						["x"] = -3.05175781250e-05,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["bars_grow_direction"] = 1,
					["backdrop_texture"] = "Details Ground",
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["plugins_grow_direction"] = 1,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["texture_custom_file"] = "Interface\\",
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
					},
					["auto_current"] = true,
					["version"] = 3,
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0.0001220703125,
							["x"] = -0.0001220703125,
							["w"] = 309.999908447266,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["bars_sort_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["micro_displays_locked"] = true,
					["clickthrough_window"] = false,
					["__was_opened"] = true,
					["show_statusbar"] = false,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 18,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["segments_auto_erase"] = 1,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
		["纳尼寇磊-卓越"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = -0.0001220703125,
							["w"] = 309.999877929688,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["desaturated_menu"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["switch_all_roles_after_wipe"] = false,
					["hide_in_combat_alpha"] = 0,
					["ignore_mass_showhide"] = false,
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 0,
						["x"] = -6.1035156250e-05,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["micro_displays_side"] = 2,
					["bars_grow_direction"] = 1,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["micro_displays_locked"] = true,
					["bars_inverted"] = false,
					["auto_current"] = true,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
					},
					["version"] = 3,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = -0.0001220703125,
							["w"] = 309.999877929688,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_tank_in_combat"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["height"] = 21,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["textL_enable_custom_text"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = true,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["font_size"] = 16,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer_in_combat"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["broadcaster_enabled"] = false,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["animation_speed_triggertravel"] = 5,
			["trash_auto_remove"] = true,
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["minimum_combat_time"] = 5,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
		["Midnightsun-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -392.000030517578,
							["x"] = 584.000244140625,
							["w"] = 309.999938964844,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["desaturated_menu"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["switch_all_roles_after_wipe"] = false,
					["hide_in_combat_alpha"] = 0,
					["ignore_mass_showhide"] = false,
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 68.9999160766602,
						["x"] = -220.999633789063,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["micro_displays_side"] = 2,
					["bars_grow_direction"] = 1,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["version"] = 3,
					["bars_inverted"] = false,
					["auto_current"] = true,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["texture_custom_file"] = "Interface\\",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = true,
						["texture"] = "BantoBar",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = true,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -392.000030517578,
							["x"] = 584.000244140625,
							["w"] = 309.999938964844,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_tank_in_combat"] = false,
					["backdrop_texture"] = "Details Ground",
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["micro_displays_locked"] = true,
					["menu_icons_size"] = 0.850000023841858,
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["Soleil-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -266.000366210938,
							["x"] = 709.001831054688,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["texture_custom_file"] = "Interface\\",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textStyle"] = 2,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["clickthrough_window"] = false,
					["hide_in_combat_alpha"] = 0,
					["desaturated_menu"] = false,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = 195.000503540039,
						["x"] = -95.999755859375,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["bars_grow_direction"] = 1,
					["skin_custom"] = "",
					["plugins_grow_direction"] = 1,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["backdrop_texture"] = "Details Ground",
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["switch_tank_in_combat"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -266.000366210938,
							["x"] = 709.001831054688,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["ignore_mass_showhide"] = false,
					["micro_displays_side"] = 2,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["bg_b"] = 0.0941176470588235,
					["show_sidebars"] = false,
					["clickthrough_rows"] = false,
					["bars_sort_direction"] = 1,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["overall_clear_logout"] = false,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["total_abbreviation"] = 2,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["broadcaster_enabled"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["哪里都排队-水晶之牙"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -461.000793457031,
							["x"] = 775.002807617188,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 0,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["micro_displays_locked"] = true,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = 6.565186049556360e-05,
						["x"] = -29.9986572265625,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 21,
						["texture_file"] = "Interface\\Addons\\SharedMedia\\statusbar\\BantoBar",
						["font_size"] = 16,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = true,
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_outline_small"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_enable_custom_text"] = false,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["switch_tank_in_combat"] = false,
					["version"] = 3,
					["auto_current"] = true,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_inverted"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -461.000793457031,
							["x"] = 775.002807617188,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["bars_grow_direction"] = 1,
					["micro_displays_side"] = 2,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["broadcaster_enabled"] = false,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["animation_speed_triggertravel"] = 5,
			["trash_auto_remove"] = true,
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["minimum_combat_time"] = 5,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
		["烟亦舞-奥罗"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["overall_flag"] = 16,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["time_type"] = 2,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -461.500175476074,
							["x"] = 725.001098632813,
							["w"] = 271.999725341797,
							["h"] = 148.999908447266,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.333333333333333, -- [1]
						0.333333333333333, -- [2]
						0.333333333333333, -- [3]
						0, -- [4]
					},
					["skin"] = "Safe Skin Legion Beta",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0,
					["__snapV"] = false,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["libwindow"] = {
						["y"] = 3.99986505508423,
						["x"] = -2.9991455078125,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["stretch_button_side"] = 1,
					["bars_grow_direction"] = 1,
					["show_sidebars"] = false,
					["bars_sort_direction"] = 1,
					["backdrop_texture"] = "Details Ground",
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["version"] = 3,
					["auto_current"] = true,
					["attribute_text"] = {
						["enabled"] = false,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 0,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 18,
						["texture_file"] = "Interface\\Buttons\\WHITE8X8",
						["texture_custom_file"] = "Interface\\",
						["font_size"] = 13,
						["icon_file"] = "",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["use_spec_icons"] = false,
						["texture_custom"] = "",
						["texture"] = "Solid",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = true,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = true,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["textR_bracket"] = "(",
					},
					["desaturated_menu"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -461.500175476074,
							["x"] = 725.001098632813,
							["w"] = 271.999725341797,
							["h"] = 148.999908447266,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["auto_hide_menu"] = {
						["left"] = true,
						["right"] = false,
					},
					["plugins_grow_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["width"] = 283.000183105469,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.703125, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["texture"] = "Interface\\TALENTFRAME\\bg-rogue-assassination",
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_tank"] = false,
					["switch_tank_in_combat"] = false,
					["skin_custom"] = "",
					["bars_inverted"] = false,
				}, -- [1]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -294.485382080078,
							["x"] = 820.008056640625,
							["w"] = 269.999908447266,
							["h"] = 145.000045776367,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.333333333333333, -- [1]
						0.333333333333333, -- [2]
						0.333333333333333, -- [3]
						0, -- [4]
					},
					["skin"] = "Safe Skin Legion Beta",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textXMod"] = 6,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["timeType"] = 1,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.045324444770813,
					["__snapV"] = false,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["clickthrough_window"] = false,
					["hide_in_combat_alpha"] = 0,
					["switch_healer_in_combat"] = false,
					["switch_damager_in_combat"] = false,
					["libwindow"] = {
						["y"] = 173.014526367188,
						["x"] = -4.991943359375,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_grow_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["skin_custom"] = "",
					["plugins_grow_direction"] = 1,
					["grab_on_top"] = false,
					["bg_b"] = 0.0941176470588235,
					["ignore_mass_showhide"] = false,
					["auto_current"] = true,
					["micro_displays_locked"] = true,
					["version"] = 3,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 0,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\BUTTONS\\WHITE8X8",
						["textR_bracket"] = "(",
						["font_size"] = 13,
						["icon_file"] = "",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["use_spec_icons"] = false,
						["textR_enable_custom_text"] = false,
						["texture"] = "ElvUI Blank",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_outline_small"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = true,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["height"] = 18,
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -294.485382080078,
							["x"] = 820.008056640625,
							["w"] = 269.999908447266,
							["h"] = 145.000045776367,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["auto_hide_menu"] = {
						["left"] = true,
						["right"] = false,
					},
					["wallpaper"] = {
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texture"] = "Interface\\TALENTFRAME\\bg-rogue-assassination",
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.703125, -- [4]
						},
						["enabled"] = true,
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["clickthrough_rows"] = false,
				}, -- [2]
			},
			["segments_amount"] = 18,
			["report_lines"] = 25,
			["clear_ungrouped"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["pvp_as_group"] = true,
			["numerical_system"] = 2,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 18,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 183.289171217067,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["segments_auto_erase"] = 1,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["death_tooltip_width"] = 350,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
			["19703"] = {
				"19703", -- [1]
				"Timer19703cd", -- [2]
				"鲁西弗隆的诅咒冷却", -- [3]
				12, -- [4]
				136123, -- [5]
				"cd", -- [6]
				19703, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["18584"] = {
				"18584", -- [1]
				"Timer18584cast", -- [2]
				"吐息", -- [3]
				5, -- [4]
				135805, -- [5]
				"cast", -- [6]
				18584, -- [7]
				3, -- [8]
				"Onyxia", -- [9]
				["id"] = 1084,
			},
			["nil"] = {
				"nil", -- [1]
				"timerShieldCD", -- [2]
				"Next Shield", -- [3]
				27.8, -- [4]
				"136116", -- [5]
				nil, -- [6]
				nil, -- [7]
				6, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["20475"] = {
				"20475", -- [1]
				"Timer20475cd", -- [2]
				"活化炸弹冷却", -- [3]
				11, -- [4]
				132863, -- [5]
				"cd", -- [6]
				20475, -- [7]
				3, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["19702"] = {
				"19702", -- [1]
				"Timer19702cd", -- [2]
				"末日降临冷却", -- [3]
				7, -- [4]
				136179, -- [5]
				"cd", -- [6]
				19702, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["19713"] = {
				"19713", -- [1]
				"Timer19713cd", -- [2]
				"沙斯拉尔的诅咒冷却", -- [3]
				6, -- [4]
				136121, -- [5]
				"cd", -- [6]
				19713, -- [7]
				3, -- [8]
				"Shazzrah", -- [9]
				["id"] = 667,
			},
			["19451"] = {
				"19451", -- [1]
				"Timer19451active", -- [2]
				"狂乱结束", -- [3]
				8, -- [4]
				132117, -- [5]
				"active", -- [6]
				19451, -- [7]
				5, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["20478"] = {
				"20478", -- [1]
				"Timer20478cast", -- [2]
				"末日决战", -- [3]
				8, -- [4]
				135826, -- [5]
				"cast", -- [6]
				20478, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["20534"] = {
				"20534", -- [1]
				"Timer20534cd", -- [2]
				"传送冷却", -- [3]
				19.4, -- [4]
				135736, -- [5]
				"cd", -- [6]
				20534, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["19695"] = {
				"19695", -- [1]
				"Timer19695active", -- [2]
				"地狱火结束", -- [3]
				8, -- [4]
				135818, -- [5]
				"active", -- [6]
				19695, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["19408"] = {
				"19408", -- [1]
				"Timer19408cd", -- [2]
				"恐慌冷却", -- [3]
				30, -- [4]
				136147, -- [5]
				"cd", -- [6]
				19408, -- [7]
				2, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["19659"] = {
				"19659", -- [1]
				"Timer19659cd", -- [2]
				"点燃法力冷却", -- [3]
				27, -- [4]
				135818, -- [5]
				"cd", -- [6]
				19659, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["20566"] = {
				"20566", -- [1]
				"Timer20566cd", -- [2]
				"拉格纳罗斯之怒冷却", -- [3]
				26.7, -- [4]
				135827, -- [5]
				"cd", -- [6]
				20566, -- [7]
				2, -- [8]
				"Ragnaros-Classic", -- [9]
				["id"] = 672,
			},
			["19492"] = {
				"19492", -- [1]
				"Timer19492cd", -- [2]
				"反魔法脉冲冷却", -- [3]
				10, -- [4]
				135894, -- [5]
				"cd", -- [6]
				19492, -- [7]
				2, -- [8]
				"Garr-Classic", -- [9]
				["id"] = 666,
			},
			["21075"] = {
				"21075", -- [1]
				"Timer21075active", -- [2]
				"伤害反射护盾结束", -- [3]
				10, -- [4]
				136121, -- [5]
				"active", -- [6]
				21075, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["20619"] = {
				"20619", -- [1]
				"Timer20619active", -- [2]
				"魔法反射结束", -- [3]
				10, -- [4]
				135849, -- [5]
				"active", -- [6]
				20619, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["19775"] = {
				"19775", -- [1]
				"Timer19775cast2", -- [2]
				"黑暗治疗", -- [3]
				2, -- [4]
				136130, -- [5]
				"cast", -- [6]
				19775, -- [7]
				4, -- [8]
				"Sulfuron", -- [9]
				["id"] = 669,
			},
			["19716"] = {
				"19716", -- [1]
				"Timer19716cd", -- [2]
				"基赫纳斯的诅咒冷却", -- [3]
				6, -- [4]
				136160, -- [5]
				"cd", -- [6]
				19716, -- [7]
				3, -- [8]
				"Gehennas", -- [9]
				["id"] = 665,
			},
		},
	},
	["disable_talent_feature"] = true,
	["spell_school_cache"] = {
		["吸取生命"] = 32,
		["奥术飞弹"] = 64,
		["火焰新星"] = 4,
		["重伤"] = 1,
		["凿击"] = 1,
		["酸液喷射"] = 8,
		["纠缠根须"] = 8,
		["虫群"] = 8,
		["腐烂胆汁"] = 8,
		["打击"] = 1,
		["怒气爆发"] = 32,
		["燃烧沥青"] = 4,
		["复仇"] = 1,
		["月火术"] = 64,
		["荆棘术"] = 8,
		["绞喉"] = 1,
		["阿鲁高的礼物"] = 32,
		["火球术"] = 4,
		["击退"] = 1,
		["汹涌"] = 1,
		["眩晕"] = 1,
		["火炬爆裂"] = 4,
		["嘲讽"] = 1,
		["痛苦诅咒"] = 32,
		["灼热武器"] = 4,
		["雷霆一击"] = 8,
		["脚踢"] = 1,
		["致命毒药"] = 8,
		["毒蛇钉刺"] = 8,
		["元素诅咒"] = 32,
		["暗言术：痛"] = 32,
		["爪击"] = 1,
		["暗影箭"] = 32,
		["摇摆意志"] = 32,
		["铁皮手雷"] = 4,
		["撕裂"] = 1,
		["灵魂燃烧"] = 4,
		["速效毒药 VI"] = 8,
		["恐怖低吼"] = 1,
		["疾病之云"] = 8,
		["闪电之盾"] = 8,
		["英勇打击"] = 1,
		["全力一击"] = 1,
		["枯萎毒药"] = 8,
		["撕咬"] = 1,
		["出血"] = 1,
		["还击"] = 1,
		["命令审判"] = 2,
		["猛击"] = 1,
		["献祭"] = 4,
		["冰霜新星"] = 16,
		["遗弃技能"] = 32,
		["深冬之寒"] = 16,
		["背刺"] = 1,
		["音素爆破"] = 1,
		["蜥蜴之矢"] = 8,
		["奥术射击"] = 64,
		["寒冰箭"] = 16,
		["缴械"] = 1,
		["钩网"] = 1,
		["刺骨"] = 1,
		["劣质炸药"] = 4,
		["冰锥术"] = 16,
		["精神鞭笞"] = 32,
		["奉献"] = 2,
		["致命毒药 IV"] = 8,
		["心灵震爆"] = 32,
		["腐臭之血"] = 32,
		["神圣之火"] = 2,
		["火焰之盾"] = 4,
		["往日的尖啸"] = 32,
		["扫击"] = 1,
		["邪恶攻击"] = 1,
		["投掷火炬"] = 4,
		["魔爆术"] = 64,
		["Corpo-a-Corpo"] = 1,
		["毒性喷溅"] = 8,
		["痛击"] = 1,
		["!Autoshot"] = 1,
		["射击"] = 1,
		["投石"] = 1,
		["压制"] = 1,
		["圣光击"] = 2,
		["闪电箭"] = 8,
		["嗜血"] = 1,
		["腐蚀术"] = 32,
		["瞄准射击"] = 1,
		["旋风斩"] = 1,
		["顺劈斩"] = 1,
		["!Melee"] = 1,
		["盾击"] = 1,
		["心灵尖啸"] = 32,
		["速效毒药 III"] = 8,
		["暗影易伤"] = 32,
		["火焰冲击"] = 4,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["data_sync"] = false,
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["run_code"] = {
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["always_use_profile"] = false,
	["createauraframe"] = {
		["y"] = 7.629394531250e-06,
		["x"] = 0.0002593994140625,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["item_level_pool"] = {
		["Player-4786-006293DB"] = {
			["time"] = 1578727709,
			["name"] = "Bravo",
			["ilvl"] = 0,
		},
		["Player-4788-00E572F4"] = {
			["name"] = "璞玉壹方",
			["time"] = 1578713731,
			["ilvl"] = 0,
		},
		["Player-4782-00BE05C0"] = {
			["name"] = "执法小爷",
			["time"] = 1578717637,
			["ilvl"] = 0,
		},
		["Player-4786-0070B4F4"] = {
			["name"] = "可乐哥",
			["time"] = 1578713739,
			["ilvl"] = 0,
		},
		["Player-4835-01535E84"] = {
			["name"] = "七千里",
			["time"] = 1578713739,
			["ilvl"] = 0,
		},
		["Player-4786-00CF7517"] = {
			["time"] = 1578727816,
			["name"] = "坏脾气啊龙",
			["ilvl"] = 0,
		},
		["Player-4524-00D2ACA4"] = {
			["name"] = "我可是贼啊",
			["time"] = 1578713738,
			["ilvl"] = 0,
		},
	},
	["realm_sync"] = true,
	["mobs_data_compiled"] = {
	},
	["switchSaved"] = {
		["slots"] = 14,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
		},
	},
	["report_where"] = "RAID",
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["plugin_window_pos"] = {
		["y"] = 27.8025054931641,
		["x"] = 99.4412078857422,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["update_warning_timeout"] = 10,
	["raid_data"] = {
		["mythic_raid_data"] = {
			[0] = {
				["longest"] = 449.005000000005,
				["kills"] = 0,
				["try_history"] = {
				},
				["wipes"] = 18,
				["best_try"] = 1,
			},
		},
	},
	["tutorial"] = {
		["bookmark_tutorial"] = false,
		["main_help_button"] = 1450,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["logons"] = 1450,
		["DETAILS_INFO_TUTORIAL2"] = 10,
		["DISABLE_ONDEATH_PANEL"] = true,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
		["FULL_DELETE_WINDOW"] = true,
		["FORGE_TUTORIAL"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["WINDOW_GROUP_MAKING1"] = true,
		["OVERALLDATA_WARNING1"] = 3,
		["unlock_button"] = 1,
		["OPTIONS_PANEL_OPENED"] = true,
		["ctrl_click_close_tutorial"] = false,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["version_announce"] = 0,
		["MIN_COMBAT_TIME"] = true,
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["show_totalhitdamage_on_overkill"] = false,
	["savedTimeCaptures"] = {
	},
	["latest_news_saw"] = "v1.13.2.181",
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the crowd control amount for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["spellid"] = false,
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 11,
		}, -- [1]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["script_version"] = 3,
		}, -- [2]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["attribute"] = false,
			["name"] = "我的技能",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["script_version"] = 8,
		}, -- [3]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对骷髅标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 4,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对其它标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 4,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["attribute"] = false,
			["name"] = "有使用药水",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["script_version"] = 5,
		}, -- [6]
		{
			["source"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["script_version"] = 15,
		}, -- [7]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["script_version"] = 2,
		}, -- [8]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["script_version"] = 2,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n				    local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n				    OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n				    s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n				    s = ToK (_, value) .. \" (\" .. s\n				end\n\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n				    return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					instance_container:AddValue (player, player.total)\n				    end\n				end\n\n				if (Details.in_combat) then\n				    for _, player in ipairs ( damage_container_current ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n					    instance_container:AddValue (player, player.total)        \n					end\n				    end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n					local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n					AllSpells [spellName] = spellTable.total\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["script_version"] = 5,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "对护盾造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["global_plugin_database"] = {
	},
	["lastUpdateWarning"] = 1578709433,
	["mobs_data"] = {
	},
}
