
WhisperPopDB = {
	["listHeight"] = 320,
	["applyFilters"] = 1,
	["listWidth"] = 200,
	["help"] = 1,
	["time"] = 1,
	["buttonScale"] = 80,
	["history"] = {
		{
			["messages"] = {
				"1[01/11 15:22:12]盗贼", -- [1]
			},
			["class"] = "PRIEST",
			["name"] = "行将就木-卓越",
		}, -- [1]
		{
			["received"] = 1,
			["class"] = "BN",
			["name"] = "无涯之术#5333",
			["messages"] = {
				"0[01/11 10:24:01]做任务去。。", -- [1]
				"1[01/11 10:24:35]在公司加班", -- [2]
				"1[01/11 10:24:51]挂机打奥山还行", -- [3]
				"1[01/11 10:25:05]黑手命令我还没拿到信", -- [4]
				"0[01/11 10:25:21]SS\\DD\\ZS都拿到了", -- [5]
				"1[01/11 10:25:38]小怪和副本门口右边的怪都掉", -- [6]
			},
		}, -- [2]
		{
			["received"] = 1,
			["messages"] = {
				"1[01/06 20:42:00]你号里有没有200G？借我下，我去消费个黑龙", -- [1]
				"0[01/06 20:42:21]有。。不过刚进黑龙", -- [2]
				"0[01/06 20:42:24]不对，战场", -- [3]
				"1[01/06 20:42:51]不急。打完了送下黑龙过来。我等会看下出装情况", -- [4]
				"1[01/10 21:03:56]帮我上号呗，我下班回家", -- [5]
				"0[01/10 21:04:09]哦", -- [6]
			},
			["class"] = "WARLOCK",
			["name"] = "无涯之术-卓越",
			["new"] = 1,
		}, -- [3]
		{
			["received"] = 1,
			["name"] = "木讷瑞瑞-卓越",
			["class"] = "WARRIOR",
			["messages"] = {
				"0[01/08 17:19:14]在?", -- [1]
				"1[01/08 17:19:35]在", -- [2]
				"1[01/08 17:19:46]还在上班", -- [3]
				"0[01/08 17:19:53]上下无涯的号 帮他挂下机", -- [4]
				"0[01/08 17:20:02]我要出门 怕等会回来排队", -- [5]
			},
			["new"] = 1,
		}, -- [4]
		{
			["received"] = 1,
			["name"] = "真德-卓越",
			["class"] = "DRUID",
			["messages"] = {
				"0[01/06 21:38:20]你怎么施放了", -- [1]
				"1[01/06 21:38:28]不小心点错了", -- [2]
				"0[01/06 21:39:25]进来别拉到怪了", -- [3]
				"1[01/06 21:39:44]在打着进不去的", -- [4]
				"0[01/06 21:40:07]....", -- [5]
			},
			["new"] = 1,
		}, -- [5]
		{
			["class"] = "ROGUE",
			["messages"] = {
				"1[01/06 20:38:53]贼", -- [1]
				"1[01/06 20:39:37]消费贼要吗", -- [2]
			},
			["name"] = "弑杀-卓越",
		}, -- [6]
		{
			["received"] = 1,
			["name"] = "嘉百列-卓越",
			["class"] = "WARRIOR",
			["messages"] = {
				"0[01/06 20:10:17]你好，请问我们是哪个服务器", -- [1]
				"1[01/06 20:10:54]不知道。国家队？", -- [2]
				"0[01/06 20:11:06]你啥服务器不知道吗", -- [3]
				"1[01/06 20:11:13]卓越", -- [4]
				"0[01/06 20:11:19]哦哦，了解了", -- [5]
			},
			["new"] = 1,
		}, -- [7]
		{
			["class"] = "SHAMAN",
			["messages"] = {
				"1[12/27 21:49:37]1", -- [1]
			},
			["name"] = "袍哥人家-卓越",
		}, -- [8]
		{
			["class"] = "DRUID",
			["messages"] = {
				"1[12/27 21:28:24]1", -- [1]
			},
			["name"] = "友哥的快乐-卓越",
		}, -- [9]
		{
			["received"] = 1,
			["name"] = "努力射两米-卓越",
			["class"] = "HUNTER",
			["messages"] = {
				"1[12/27 21:08:33]贼要吗", -- [1]
				"0[12/27 21:08:39]有两个了", -- [2]
			},
			["new"] = 1,
		}, -- [10]
		{
			["received"] = 1,
			["name"] = "集火星星-卓越",
			["class"] = "WARLOCK",
			["messages"] = {
				"0[12/27 20:55:42]1", -- [1]
			},
			["new"] = 1,
		}, -- [11]
		{
			["received"] = 1,
			["name"] = "号租被骗勿扰-卓越",
			["class"] = "MAGE",
			["messages"] = {
				"0[12/27 20:49:07]下马", -- [1]
			},
			["new"] = 1,
		}, -- [12]
		{
			["received"] = 1,
			["class"] = "MAGE",
			["name"] = "大白鹅-奥罗",
			["messages"] = {
				"1[12/14 09:30:47]给点面包 法爷 谢谢", -- [1]
				"0[12/14 09:31:10]交易", -- [2]
				"0[12/14 09:31:30]与[烟亦舞]交易成功。(交出) 2件物品", -- [3]
				"1[12/14 09:31:36]谢谢", -- [4]
			},
		}, -- [13]
		{
			["class"] = "MAGE",
			["messages"] = {
				"1[12/13 23:40:13]法爷能给点面包吗谢谢", -- [1]
				"1[12/13 23:40:44]谢谢", -- [2]
			},
			["name"] = "骨灰级大妈-奥罗",
		}, -- [14]
	},
	["ignoreTags"] = 1,
	["version"] = 4.12,
	["foreignOnly"] = 1,
	["listScale"] = 100,
	["sound"] = 1,
	["save"] = 1,
}
